MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
#ifndef INCLUDED_CYFITTER_H
#define INCLUDED_CYFITTER_H
#include <cydevice.h>
#include <cydevice_trm.h>

/* Pin_Matrix_Switch_ISR_Time */
#define Pin_Matrix_Switch_ISR_Time__0__MASK 0x20u
#define Pin_Matrix_Switch_ISR_Time__0__PC CYREG_PRT1_PC5
#define Pin_Matrix_Switch_ISR_Time__0__PORT 1
#define Pin_Matrix_Switch_ISR_Time__0__SHIFT 5
#define Pin_Matrix_Switch_ISR_Time__AG CYREG_PRT1_AG
#define Pin_Matrix_Switch_ISR_Time__AMUX CYREG_PRT1_AMUX
#define Pin_Matrix_Switch_ISR_Time__BIE CYREG_PRT1_BIE
#define Pin_Matrix_Switch_ISR_Time__BIT_MASK CYREG_PRT1_BIT_MASK
#define Pin_Matrix_Switch_ISR_Time__BYP CYREG_PRT1_BYP
#define Pin_Matrix_Switch_ISR_Time__CTL CYREG_PRT1_CTL
#define Pin_Matrix_Switch_ISR_Time__DM0 CYREG_PRT1_DM0
#define Pin_Matrix_Switch_ISR_Time__DM1 CYREG_PRT1_DM1
#define Pin_Matrix_Switch_ISR_Time__DM2 CYREG_PRT1_DM2
#define Pin_Matrix_Switch_ISR_Time__DR CYREG_PRT1_DR
#define Pin_Matrix_Switch_ISR_Time__INP_DIS CYREG_PRT1_INP_DIS
#define Pin_Matrix_Switch_ISR_Time__LCD_COM_SEG CYREG_PRT1_LCD_COM_SEG
#define Pin_Matrix_Switch_ISR_Time__LCD_EN CYREG_PRT1_LCD_EN
#define Pin_Matrix_Switch_ISR_Time__MASK 0x20u
#define Pin_Matrix_Switch_ISR_Time__PORT 1
#define Pin_Matrix_Switch_ISR_Time__PRT CYREG_PRT1_PRT
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__CAPS_SEL CYREG_PRT1_CAPS_SEL
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__DBL_SYNC_IN CYREG_PRT1_DBL_SYNC_IN
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__OE_SEL0 CYREG_PRT1_OE_SEL0
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__OE_SEL1 CYREG_PRT1_OE_SEL1
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__OUT_SEL0 CYREG_PRT1_OUT_SEL0
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__OUT_SEL1 CYREG_PRT1_OUT_SEL1
#define Pin_Matrix_Switch_ISR_Time__PRTDSI__SYNC_OUT CYREG_PRT1_SYNC_OUT
#define Pin_Matrix_Switch_ISR_Time__PS CYREG_PRT1_PS
#define Pin_Matrix_Switch_ISR_Time__SHIFT 5
#define Pin_Matrix_Switch_ISR_Time__SLW CYREG_PRT1_SLW

/* Pin_Soft_Filter_Time */
#define Pin_Soft_Filter_Time__0__MASK 0x10u
#define Pin_Soft_Filter_Time__0__PC CYREG_PRT1_PC4
#define Pin_Soft_Filter_Time__0__PORT 1
#define Pin_Soft_Filter_Time__0__SHIFT 4
#define Pin_Soft_Filter_Time__AG CYREG_PRT1_AG
#define Pin_Soft_Filter_Time__AMUX CYREG_PRT1_AMUX
#define Pin_Soft_Filter_Time__BIE CYREG_PRT1_BIE
#define Pin_Soft_Filter_Time__BIT_MASK CYREG_PRT1_BIT_MASK
#define Pin_Soft_Filter_Time__BYP CYREG_PRT1_BYP
#define Pin_Soft_Filter_Time__CTL CYREG_PRT1_CTL
#define Pin_Soft_Filter_Time__DM0 CYREG_PRT1_DM0
#define Pin_Soft_Filter_Time__DM1 CYREG_PRT1_DM1
#define Pin_Soft_Filter_Time__DM2 CYREG_PRT1_DM2
#define Pin_Soft_Filter_Time__DR CYREG_PRT1_DR
#define Pin_Soft_Filter_Time__INP_DIS CYREG_PRT1_INP_DIS
#define Pin_Soft_Filter_Time__LCD_COM_SEG CYREG_PRT1_LCD_COM_SEG
#define Pin_Soft_Filter_Time__LCD_EN CYREG_PRT1_LCD_EN
#define Pin_Soft_Filter_Time__MASK 0x10u
#define Pin_Soft_Filter_Time__PORT 1
#define Pin_Soft_Filter_Time__PRT CYREG_PRT1_PRT
#define Pin_Soft_Filter_Time__PRTDSI__CAPS_SEL CYREG_PRT1_CAPS_SEL
#define Pin_Soft_Filter_Time__PRTDSI__DBL_SYNC_IN CYREG_PRT1_DBL_SYNC_IN
#define Pin_Soft_Filter_Time__PRTDSI__OE_SEL0 CYREG_PRT1_OE_SEL0
#define Pin_Soft_Filter_Time__PRTDSI__OE_SEL1 CYREG_PRT1_OE_SEL1
#define Pin_Soft_Filter_Time__PRTDSI__OUT_SEL0 CYREG_PRT1_OUT_SEL0
#define Pin_Soft_Filter_Time__PRTDSI__OUT_SEL1 CYREG_PRT1_OUT_SEL1
#define Pin_Soft_Filter_Time__PRTDSI__SYNC_OUT CYREG_PRT1_SYNC_OUT
#define Pin_Soft_Filter_Time__PS CYREG_PRT1_PS
#define Pin_Soft_Filter_Time__SHIFT 4
#define Pin_Soft_Filter_Time__SLW CYREG_PRT1_SLW

/* VDAC8_Debug_viDAC8 */
#define VDAC8_Debug_viDAC8__CR0 CYREG_DAC3_CR0
#define VDAC8_Debug_viDAC8__CR1 CYREG_DAC3_CR1
#define VDAC8_Debug_viDAC8__D CYREG_DAC3_D
#define VDAC8_Debug_viDAC8__PM_ACT_CFG CYREG_PM_ACT_CFG8
#define VDAC8_Debug_viDAC8__PM_ACT_MSK 0x08u
#define VDAC8_Debug_viDAC8__PM_STBY_CFG CYREG_PM_STBY_CFG8
#define VDAC8_Debug_viDAC8__PM_STBY_MSK 0x08u
#define VDAC8_Debug_viDAC8__STROBE CYREG_DAC3_STROBE
#define VDAC8_Debug_viDAC8__SW0 CYREG_DAC3_SW0
#define VDAC8_Debug_viDAC8__SW2 CYREG_DAC3_SW2
#define VDAC8_Debug_viDAC8__SW3 CYREG_DAC3_SW3
#define VDAC8_Debug_viDAC8__SW4 CYREG_DAC3_SW4
#define VDAC8_Debug_viDAC8__TR CYREG_DAC3_TR
#define VDAC8_Debug_viDAC8__TRIM__M1 CYREG_FLSHID_CUST_TABLES_DAC3_M1
#define VDAC8_Debug_viDAC8__TRIM__M2 CYREG_FLSHID_CUST_TABLES_DAC3_M2
#define VDAC8_Debug_viDAC8__TRIM__M3 CYREG_FLSHID_CUST_TABLES_DAC3_M3
#define VDAC8_Debug_viDAC8__TRIM__M4 CYREG_FLSHID_CUST_TABLES_DAC3_M4
#define VDAC8_Debug_viDAC8__TRIM__M5 CYREG_FLSHID_CUST_TABLES_DAC3_M5
#define VDAC8_Debug_viDAC8__TRIM__M6 CYREG_FLSHID_CUST_TABLES_DAC3_M6
#define VDAC8_Debug_viDAC8__TRIM__M7 CYREG_FLSHID_CUST_TABLES_DAC3_M7
#define VDAC8_Debug_viDAC8__TRIM__M8 CYREG_FLSHID_CUST_TABLES_DAC3_M8
#define VDAC8_Debug_viDAC8__TRIM__TR CYREG_FLSHID_MFG_CFG_DAC3_TR
#define VDAC8_Debug_viDAC8__TST CYREG_DAC3_TST

/* ADC_SAR_A_ADC_SAR */
#define ADC_SAR_A_ADC_SAR__CLK CYREG_SAR0_CLK
#define ADC_SAR_A_ADC_SAR__CSR0 CYREG_SAR0_CSR0
#define ADC_SAR_A_ADC_SAR__CSR1 CYREG_SAR0_CSR1
#define ADC_SAR_A_ADC_SAR__CSR2 CYREG_SAR0_CSR2
#define ADC_SAR_A_ADC_SAR__CSR3 CYREG_SAR0_CSR3
#define ADC_SAR_A_ADC_SAR__CSR4 CYREG_SAR0_CSR4
#define ADC_SAR_A_ADC_SAR__CSR5 CYREG_SAR0_CSR5
#define ADC_SAR_A_ADC_SAR__CSR6 CYREG_SAR0_CSR6
#define ADC_SAR_A_ADC_SAR__CSR7 CYREG_SAR0_CSR7
#define ADC_SAR_A_ADC_SAR__PM_ACT_CFG CYREG_PM_ACT_CFG11
#define ADC_SAR_A_ADC_SAR__PM_ACT_MSK 0x01u
#define ADC_SAR_A_ADC_SAR__PM_STBY_CFG CYREG_PM_STBY_CFG11
#define ADC_SAR_A_ADC_SAR__PM_STBY_MSK 0x01u
#define ADC_SAR_A_ADC_SAR__SW0 CYREG_SAR0_SW0
#define ADC_SAR_A_ADC_SAR__SW2 CYREG_SAR0_SW2
#define ADC_SAR_A_ADC_SAR__SW3 CYREG_SAR0_SW3
#define ADC_SAR_A_ADC_SAR__SW4 CYREG_SAR0_SW4
#define ADC_SAR_A_ADC_SAR__SW6 CYREG_SAR0_SW6
#define ADC_SAR_A_ADC_SAR__TR0 CYREG_SAR0_TR0
#define ADC_SAR_A_ADC_SAR__TRIM__TR0 CYREG_FLSHID_MFG_CFG_SAR0_TR0
#define ADC_SAR_A_ADC_SAR__TRIM__TR1 CYREG_FLSHID_MFG_CFG_SAR0_TR1
#define ADC_SAR_A_ADC_SAR__WRK0 CYREG_SAR0_WRK0
#define ADC_SAR_A_ADC_SAR__WRK1 CYREG_SAR0_WRK1

/* ADC_SAR_A_theACLK */
#define ADC_SAR_A_theACLK__CFG0 CYREG_CLKDIST_DCFG1_CFG0
#define ADC_SAR_A_theACLK__CFG1 CYREG_CLKDIST_DCFG1_CFG1
#define ADC_SAR_A_theACLK__CFG2 CYREG_CLKDIST_DCFG1_CFG2
#define ADC_SAR_A_theACLK__CFG2_SRC_SEL_MASK 0x07u
#define ADC_SAR_A_theACLK__PM_ACT_CFG CYREG_PM_ACT_CFG2
#define ADC_SAR_A_theACLK__PM_ACT_MSK 0x02u
#define ADC_SAR_A_theACLK__PM_STBY_CFG CYREG_PM_STBY_CFG2
#define ADC_SAR_A_theACLK__PM_STBY_MSK 0x02u

