MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* ADC_SAR_B_ADC_SAR */
#define ADC_SAR_B_ADC_SAR__CLK CYREG_SAR1_CLK
#define ADC_SAR_B_ADC_SAR__CSR0 CYREG_SAR1_CSR0
#define ADC_SAR_B_ADC_SAR__CSR1 CYREG_SAR1_CSR1
#define ADC_SAR_B_ADC_SAR__CSR2 CYREG_SAR1_CSR2
#define ADC_SAR_B_ADC_SAR__CSR3 CYREG_SAR1_CSR3
#define ADC_SAR_B_ADC_SAR__CSR4 CYREG_SAR1_CSR4
#define ADC_SAR_B_ADC_SAR__CSR5 CYREG_SAR1_CSR5
#define ADC_SAR_B_ADC_SAR__CSR6 CYREG_SAR1_CSR6
#define ADC_SAR_B_ADC_SAR__CSR7 CYREG_SAR1_CSR7
#define ADC_SAR_B_ADC_SAR__PM_ACT_CFG CYREG_PM_ACT_CFG11
#define ADC_SAR_B_ADC_SAR__PM_ACT_MSK 0x02u
#define ADC_SAR_B_ADC_SAR__PM_STBY_CFG CYREG_PM_STBY_CFG11
#define ADC_SAR_B_ADC_SAR__PM_STBY_MSK 0x02u
#define ADC_SAR_B_ADC_SAR__SW0 CYREG_SAR1_SW0
#define ADC_SAR_B_ADC_SAR__SW2 CYREG_SAR1_SW2
#define ADC_SAR_B_ADC_SAR__SW3 CYREG_SAR1_SW3
#define ADC_SAR_B_ADC_SAR__SW4 CYREG_SAR1_SW4
#define ADC_SAR_B_ADC_SAR__SW6 CYREG_SAR1_SW6
#define ADC_SAR_B_ADC_SAR__TR0 CYREG_SAR1_TR0
#define ADC_SAR_B_ADC_SAR__TRIM__TR0 CYREG_FLSHID_MFG_CFG_SAR1_TR0
#define ADC_SAR_B_ADC_SAR__TRIM__TR1 CYREG_FLSHID_MFG_CFG_SAR1_TR1
#define ADC_SAR_B_ADC_SAR__WRK0 CYREG_SAR1_WRK0
#define ADC_SAR_B_ADC_SAR__WRK1 CYREG_SAR1_WRK1

/* ADC_SAR_B_theACLK */
#define ADC_SAR_B_theACLK__CFG0 CYREG_CLKDIST_DCFG0_CFG0
#define ADC_SAR_B_theACLK__CFG1 CYREG_CLKDIST_DCFG0_CFG1
#define ADC_SAR_B_theACLK__CFG2 CYREG_CLKDIST_DCFG0_CFG2
#define ADC_SAR_B_theACLK__CFG2_SRC_SEL_MASK 0x07u
#define ADC_SAR_B_theACLK__PM_ACT_CFG CYREG_PM_ACT_CFG2
#define ADC_SAR_B_theACLK__PM_ACT_MSK 0x01u
#define ADC_SAR_B_theACLK__PM_STBY_CFG CYREG_PM_STBY_CFG2
#define ADC_SAR_B_theACLK__PM_STBY_MSK 0x01u

/* USBUART_bus_reset */
#define USBUART_bus_reset__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_bus_reset__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_bus_reset__INTC_MASK 0x10000000u
#define USBUART_bus_reset__INTC_NUMBER 28
#define USBUART_bus_reset__INTC_PRIOR_NUM 7
#define USBUART_bus_reset__INTC_PRIOR_REG CYREG_NVIC_PRI_28
#define USBUART_bus_reset__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_bus_reset__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* Clock_Signal_Out */
#define Clock_Signal_Out__CFG0 CYREG_CLKDIST_DCFG2_CFG0
#define Clock_Signal_Out__CFG1 CYREG_CLKDIST_DCFG2_CFG1
#define Clock_Signal_Out__CFG2 CYREG_CLKDIST_DCFG2_CFG2
#define Clock_Signal_Out__CFG2_SRC_SEL_MASK 0x07u
#define Clock_Signal_Out__PM_ACT_CFG CYREG_PM_ACT_CFG2
#define Clock_Signal_Out__PM_ACT_MSK 0x04u
#define Clock_Signal_Out__PM_STBY_CFG CYREG_PM_STBY_CFG2
#define Clock_Signal_Out__PM_STBY_MSK 0x04u

/* ISR_Debug_Fast_2 */
#define ISR_Debug_Fast_2__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ISR_Debug_Fast_2__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ISR_Debug_Fast_2__INTC_MASK 0x01u
#define ISR_Debug_Fast_2__INTC_NUMBER 0
#define ISR_Debug_Fast_2__INTC_PRIOR_NUM 7
#define ISR_Debug_Fast_2__INTC_PRIOR_REG CYREG_NVIC_PRI_0
#define ISR_Debug_Fast_2__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ISR_Debug_Fast_2__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* Opamp_Debug_ABuf */
#define Opamp_Debug_ABuf__CR CYREG_ABUF3_CR
#define Opamp_Debug_ABuf__MX CYREG_ABUF3_MX
#define Opamp_Debug_ABuf__NPUMP_ABUF_TR0 CYREG_NPUMP_ABUF_TR0
#define Opamp_Debug_ABuf__PM_ACT_CFG CYREG_PM_ACT_CFG4
#define Opamp_Debug_ABuf__PM_ACT_MSK 0x08u
#define Opamp_Debug_ABuf__PM_STBY_CFG CYREG_PM_STBY_CFG4
#define Opamp_Debug_ABuf__PM_STBY_MSK 0x08u
#define Opamp_Debug_ABuf__RSVD CYREG_ABUF3_RSVD
#define Opamp_Debug_ABuf__SW CYREG_ABUF3_SW
#define Opamp_Debug_ABuf__TR0 CYREG_ABUF3_TR0
#define Opamp_Debug_ABuf__TR1 CYREG_ABUF3_TR1

/* Pin_Opamp_A_plus */
#define Pin_Opamp_A_plus__0__MASK 0x10u
#define Pin_Opamp_A_plus__0__PC CYREG_PRT0_PC4
#define Pin_Opamp_A_plus__0__PORT 0
#define Pin_Opamp_A_plus__0__SHIFT 4
#define Pin_Opamp_A_plus__AG CYREG_PRT0_AG
#define Pin_Opamp_A_plus__AMUX CYREG_PRT0_AMUX
#define Pin_Opamp_A_plus__BIE CYREG_PRT0_BIE
#define Pin_Opamp_A_plus__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Opamp_A_plus__BYP CYREG_PRT0_BYP
#define Pin_Opamp_A_plus__CTL CYREG_PRT0_CTL
#define Pin_Opamp_A_plus__DM0 CYREG_PRT0_DM0
#define Pin_Opamp_A_plus__DM1 CYREG_PRT0_DM1
#define Pin_Opamp_A_plus__DM2 CYREG_PRT0_DM2
#define Pin_Opamp_A_plus__DR CYREG_PRT0_DR
#define Pin_Opamp_A_plus__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Opamp_A_plus__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Opamp_A_plus__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Opamp_A_plus__PORT 0
#define Pin_Opamp_A_plus__PRT CYREG_PRT0_PRT
#define Pin_Opamp_A_plus__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Opamp_A_plus__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Opamp_A_plus__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Opamp_A_plus__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Opamp_A_plus__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Opamp_A_plus__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Opamp_A_plus__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Opamp_A_plus__PS CYREG_PRT0_PS
#define Pin_Opamp_A_plus__SLW CYREG_PRT0_SLW

/* Pin_Opamp_B_plus */
#define Pin_Opamp_B_plus__0__MASK 0x04u
#define Pin_Opamp_B_plus__0__PC CYREG_PRT0_PC2
#define Pin_Opamp_B_plus__0__PORT 0
#define Pin_Opamp_B_plus__0__SHIFT 2
#define Pin_Opamp_B_plus__AG CYREG_PRT0_AG
#define Pin_Opamp_B_plus__AMUX CYREG_PRT0_AMUX
#define Pin_Opamp_B_plus__BIE CYREG_PRT0_BIE
#define Pin_Opamp_B_plus__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Opamp_B_plus__BYP CYREG_PRT0_BYP
#define Pin_Opamp_B_plus__CTL CYREG_PRT0_CTL
#define Pin_Opamp_B_plus__DM0 CYREG_PRT0_DM0
#define Pin_Opamp_B_plus__DM1 CYREG_PRT0_DM1
#define Pin_Opamp_B_plus__DM2 CYREG_PRT0_DM2
#define Pin_Opamp_B_plus__DR CYREG_PRT0_DR
#define Pin_Opamp_B_plus__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Opamp_B_plus__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Opamp_B_plus__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Opamp_B_plus__PORT 0
#define Pin_Opamp_B_plus__PRT CYREG_PRT0_PRT
#define Pin_Opamp_B_plus__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Opamp_B_plus__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Opamp_B_plus__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Opamp_B_plus__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Opamp_B_plus__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Opamp_B_plus__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Opamp_B_plus__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Opamp_B_plus__PS CYREG_PRT0_PS
#define Pin_Opamp_B_plus__SLW CYREG_PRT0_SLW

/* Opamp_Vref_ABuf */
#define Opamp_Vref_ABuf__CR CYREG_ABUF1_CR
#define Opamp_Vref_ABuf__MX CYREG_ABUF1_MX
#define Opamp_Vref_ABuf__NPUMP_ABUF_TR0 CYREG_NPUMP_ABUF_TR0
#define Opamp_Vref_ABuf__PM_ACT_CFG CYREG_PM_ACT_CFG4
#define Opamp_Vref_ABuf__PM_ACT_MSK 0x02u
#define Opamp_Vref_ABuf__PM_STBY_CFG CYREG_PM_STBY_CFG4
#define Opamp_Vref_ABuf__PM_STBY_MSK 0x02u
#define Opamp_Vref_ABuf__RSVD CYREG_ABUF1_RSVD
#define Opamp_Vref_ABuf__SW CYREG_ABUF1_SW
#define Opamp_Vref_ABuf__TR0 CYREG_ABUF1_TR0
#define Opamp_Vref_ABuf__TR1 CYREG_ABUF1_TR1

/* PGA_Stage1_A_SC */
#define PGA_Stage1_A_SC__BST CYREG_SC2_BST
#define PGA_Stage1_A_SC__CLK CYREG_SC2_CLK
#define PGA_Stage1_A_SC__CR0 CYREG_SC2_CR0
#define PGA_Stage1_A_SC__CR1 CYREG_SC2_CR1
#define PGA_Stage1_A_SC__CR2 CYREG_SC2_CR2
#define PGA_Stage1_A_SC__MSK CYREG_SC_MSK
#define PGA_Stage1_A_SC__PM_ACT_CFG CYREG_PM_ACT_CFG9
#define PGA_Stage1_A_SC__PM_ACT_MSK 0x02u
#define PGA_Stage1_A_SC__PM_STBY_CFG CYREG_PM_STBY_CFG9
#define PGA_Stage1_A_SC__PM_STBY_MSK 0x02u
#define PGA_Stage1_A_SC__SR CYREG_SC_SR
#define PGA_Stage1_A_SC__SW0 CYREG_SC2_SW0
#define PGA_Stage1_A_SC__SW10 CYREG_SC2_SW10
#define PGA_Stage1_A_SC__SW2 CYREG_SC2_SW2
#define PGA_Stage1_A_SC__SW3 CYREG_SC2_SW3
#define PGA_Stage1_A_SC__SW4 CYREG_SC2_SW4
#define PGA_Stage1_A_SC__SW6 CYREG_SC2_SW6
#define PGA_Stage1_A_SC__SW7 CYREG_SC2_SW7
#define PGA_Stage1_A_SC__SW8 CYREG_SC2_SW8

/* PGA_Stage1_B_SC */
#define PGA_Stage1_B_SC__BST CYREG_SC1_BST
#define PGA_Stage1_B_SC__CLK CYREG_SC1_CLK
#define PGA_Stage1_B_SC__CR0 CYREG_SC1_CR0
#define PGA_Stage1_B_SC__CR1 CYREG_SC1_CR1
#define PGA_Stage1_B_SC__CR2 CYREG_SC1_CR2
#define PGA_Stage1_B_SC__MSK CYREG_SC_MSK
#define PGA_Stage1_B_SC__PM_ACT_CFG CYREG_PM_ACT_CFG9
#define PGA_Stage1_B_SC__PM_ACT_MSK 0x04u
#define PGA_Stage1_B_SC__PM_STBY_CFG CYREG_PM_STBY_CFG9
#define PGA_Stage1_B_SC__PM_STBY_MSK 0x04u
#define PGA_Stage1_B_SC__SR CYREG_SC_SR
#define PGA_Stage1_B_SC__SW0 CYREG_SC1_SW0
#define PGA_Stage1_B_SC__SW10 CYREG_SC1_SW10
#define PGA_Stage1_B_SC__SW2 CYREG_SC1_SW2
#define PGA_Stage1_B_SC__SW3 CYREG_SC1_SW3
#define PGA_Stage1_B_SC__SW4 CYREG_SC1_SW4
#define PGA_Stage1_B_SC__SW6 CYREG_SC1_SW6
#define PGA_Stage1_B_SC__SW7 CYREG_SC1_SW7
#define PGA_Stage1_B_SC__SW8 CYREG_SC1_SW8

/* PGA_Stage2_A_SC */
#define PGA_Stage2_A_SC__BST CYREG_SC0_BST
#define PGA_Stage2_A_SC__CLK CYREG_SC0_CLK
#define PGA_Stage2_A_SC__CR0 CYREG_SC0_CR0
#define PGA_Stage2_A_SC__CR1 CYREG_SC0_CR1
#define PGA_Stage2_A_SC__CR2 CYREG_SC0_CR2
#define PGA_Stage2_A_SC__MSK CYREG_SC_MSK
#define PGA_Stage2_A_SC__PM_ACT_CFG CYREG_PM_ACT_CFG9
#define PGA_Stage2_A_SC__PM_ACT_MSK 0x01u
#define PGA_Stage2_A_SC__PM_STBY_CFG CYREG_PM_STBY_CFG9
#define PGA_Stage2_A_SC__PM_STBY_MSK 0x01u
#define PGA_Stage2_A_SC__SR CYREG_SC_SR
#define PGA_Stage2_A_SC__SW0 CYREG_SC0_SW0
#define PGA_Stage2_A_SC__SW10 CYREG_SC0_SW10
#define PGA_Stage2_A_SC__SW2 CYREG_SC0_SW2
#define PGA_Stage2_A_SC__SW3 CYREG_SC0_SW3
#define PGA_Stage2_A_SC__SW4 CYREG_SC0_SW4
#define PGA_Stage2_A_SC__SW6 CYREG_SC0_SW6
#define PGA_Stage2_A_SC__SW7 CYREG_SC0_SW7
#define PGA_Stage2_A_SC__SW8 CYREG_SC0_SW8

/* PGA_Stage2_B_SC */
#define PGA_Stage2_B_SC__BST CYREG_SC3_BST
#define PGA_Stage2_B_SC__CLK CYREG_SC3_CLK
#define PGA_Stage2_B_SC__CR0 CYREG_SC3_CR0
#define PGA_Stage2_B_SC__CR1 CYREG_SC3_CR1
#define PGA_Stage2_B_SC__CR2 CYREG_SC3_CR2
#define PGA_Stage2_B_SC__MSK CYREG_SC_MSK
#define PGA_Stage2_B_SC__PM_ACT_CFG CYREG_PM_ACT_CFG9
#define PGA_Stage2_B_SC__PM_ACT_MSK 0x08u
#define PGA_Stage2_B_SC__PM_STBY_CFG CYREG_PM_STBY_CFG9
#define PGA_Stage2_B_SC__PM_STBY_MSK 0x08u
#define PGA_Stage2_B_SC__SR CYREG_SC_SR
#define PGA_Stage2_B_SC__SW0 CYREG_SC3_SW0
#define PGA_Stage2_B_SC__SW10 CYREG_SC3_SW10
#define PGA_Stage2_B_SC__SW2 CYREG_SC3_SW2
#define PGA_Stage2_B_SC__SW3 CYREG_SC3_SW3
#define PGA_Stage2_B_SC__SW4 CYREG_SC3_SW4
#define PGA_Stage2_B_SC__SW6 CYREG_SC3_SW6
#define PGA_Stage2_B_SC__SW7 CYREG_SC3_SW7
#define PGA_Stage2_B_SC__SW8 CYREG_SC3_SW8

/* Pin_Opamp_A_out */
#define Pin_Opamp_A_out__0__MASK 0x01u
#define Pin_Opamp_A_out__0__PC CYREG_PRT0_PC0
#define Pin_Opamp_A_out__0__PORT 0
#define Pin_Opamp_A_out__0__SHIFT 0
#define Pin_Opamp_A_out__AG CYREG_PRT0_AG
#define Pin_Opamp_A_out__AMUX CYREG_PRT0_AMUX
#define Pin_Opamp_A_out__BIE CYREG_PRT0_BIE
#define Pin_Opamp_A_out__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Opamp_A_out__BYP CYREG_PRT0_BYP
#define Pin_Opamp_A_out__CTL CYREG_PRT0_CTL
#define Pin_Opamp_A_out__DM0 CYREG_PRT0_DM0
#define Pin_Opamp_A_out__DM1 CYREG_PRT0_DM1
#define Pin_Opamp_A_out__DM2 CYREG_PRT0_DM2
#define Pin_Opamp_A_out__DR CYREG_PRT0_DR
#define Pin_Opamp_A_out__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Opamp_A_out__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Opamp_A_out__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Opamp_A_out__PORT 0
#define Pin_Opamp_A_out__PRT CYREG_PRT0_PRT
#define Pin_Opamp_A_out__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Opamp_A_out__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Opamp_A_out__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Opamp_A_out__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Opamp_A_out__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Opamp_A_out__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Opamp_A_out__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Opamp_A_out__PS CYREG_PRT0_PS
#define Pin_Opamp_A_out__SLW CYREG_PRT0_SLW

