MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Pin_Opamp_B_out */
#define Pin_Opamp_B_out__0__MASK 0x02u
#define Pin_Opamp_B_out__0__PC CYREG_PRT0_PC1
#define Pin_Opamp_B_out__0__PORT 0
#define Pin_Opamp_B_out__0__SHIFT 1
#define Pin_Opamp_B_out__AG CYREG_PRT0_AG
#define Pin_Opamp_B_out__AMUX CYREG_PRT0_AMUX
#define Pin_Opamp_B_out__BIE CYREG_PRT0_BIE
#define Pin_Opamp_B_out__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Opamp_B_out__BYP CYREG_PRT0_BYP
#define Pin_Opamp_B_out__CTL CYREG_PRT0_CTL
#define Pin_Opamp_B_out__DM0 CYREG_PRT0_DM0
#define Pin_Opamp_B_out__DM1 CYREG_PRT0_DM1
#define Pin_Opamp_B_out__DM2 CYREG_PRT0_DM2
#define Pin_Opamp_B_out__DR CYREG_PRT0_DR
#define Pin_Opamp_B_out__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Opamp_B_out__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Opamp_B_out__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Opamp_B_out__PORT 0
#define Pin_Opamp_B_out__PRT CYREG_PRT0_PRT
#define Pin_Opamp_B_out__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Opamp_B_out__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Opamp_B_out__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Opamp_B_out__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Opamp_B_out__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Opamp_B_out__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Opamp_B_out__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Opamp_B_out__PS CYREG_PRT0_PS
#define Pin_Opamp_B_out__SLW CYREG_PRT0_SLW

/* Pin_Signal_In_A */
#define Pin_Signal_In_A__0__MASK 0x08u
#define Pin_Signal_In_A__0__PC CYREG_PRT0_PC3
#define Pin_Signal_In_A__0__PORT 0
#define Pin_Signal_In_A__0__SHIFT 3
#define Pin_Signal_In_A__AG CYREG_PRT0_AG
#define Pin_Signal_In_A__AMUX CYREG_PRT0_AMUX
#define Pin_Signal_In_A__BIE CYREG_PRT0_BIE
#define Pin_Signal_In_A__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Signal_In_A__BYP CYREG_PRT0_BYP
#define Pin_Signal_In_A__CTL CYREG_PRT0_CTL
#define Pin_Signal_In_A__DM0 CYREG_PRT0_DM0
#define Pin_Signal_In_A__DM1 CYREG_PRT0_DM1
#define Pin_Signal_In_A__DM2 CYREG_PRT0_DM2
#define Pin_Signal_In_A__DR CYREG_PRT0_DR
#define Pin_Signal_In_A__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Signal_In_A__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Signal_In_A__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Signal_In_A__PORT 0
#define Pin_Signal_In_A__PRT CYREG_PRT0_PRT
#define Pin_Signal_In_A__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Signal_In_A__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Signal_In_A__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Signal_In_A__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Signal_In_A__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Signal_In_A__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Signal_In_A__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Signal_In_A__PS CYREG_PRT0_PS
#define Pin_Signal_In_A__SLW CYREG_PRT0_SLW

/* Pin_Signal_In_B */
#define Pin_Signal_In_B__0__MASK 0x04u
#define Pin_Signal_In_B__0__PC CYREG_PRT1_PC2
#define Pin_Signal_In_B__0__PORT 1
#define Pin_Signal_In_B__0__SHIFT 2
#define Pin_Signal_In_B__AG CYREG_PRT1_AG
#define Pin_Signal_In_B__AMUX CYREG_PRT1_AMUX
#define Pin_Signal_In_B__BIE CYREG_PRT1_BIE
#define Pin_Signal_In_B__BIT_MASK CYREG_PRT1_BIT_MASK
#define Pin_Signal_In_B__BYP CYREG_PRT1_BYP
#define Pin_Signal_In_B__CTL CYREG_PRT1_CTL
#define Pin_Signal_In_B__DM0 CYREG_PRT1_DM0
#define Pin_Signal_In_B__DM1 CYREG_PRT1_DM1
#define Pin_Signal_In_B__DM2 CYREG_PRT1_DM2
#define Pin_Signal_In_B__DR CYREG_PRT1_DR
#define Pin_Signal_In_B__INP_DIS CYREG_PRT1_INP_DIS
#define Pin_Signal_In_B__LCD_COM_SEG CYREG_PRT1_LCD_COM_SEG
#define Pin_Signal_In_B__LCD_EN CYREG_PRT1_LCD_EN
#define Pin_Signal_In_B__PORT 1
#define Pin_Signal_In_B__PRT CYREG_PRT1_PRT
#define Pin_Signal_In_B__PRTDSI__CAPS_SEL CYREG_PRT1_CAPS_SEL
#define Pin_Signal_In_B__PRTDSI__DBL_SYNC_IN CYREG_PRT1_DBL_SYNC_IN
#define Pin_Signal_In_B__PRTDSI__OE_SEL0 CYREG_PRT1_OE_SEL0
#define Pin_Signal_In_B__PRTDSI__OE_SEL1 CYREG_PRT1_OE_SEL1
#define Pin_Signal_In_B__PRTDSI__OUT_SEL0 CYREG_PRT1_OUT_SEL0
#define Pin_Signal_In_B__PRTDSI__OUT_SEL1 CYREG_PRT1_OUT_SEL1
#define Pin_Signal_In_B__PRTDSI__SYNC_OUT CYREG_PRT1_SYNC_OUT
#define Pin_Signal_In_B__PS CYREG_PRT1_PS
#define Pin_Signal_In_B__SLW CYREG_PRT1_SLW

/* USBUART_arb_int */
#define USBUART_arb_int__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_arb_int__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_arb_int__INTC_MASK 0x400000u
#define USBUART_arb_int__INTC_NUMBER 22
#define USBUART_arb_int__INTC_PRIOR_NUM 7
#define USBUART_arb_int__INTC_PRIOR_REG CYREG_NVIC_PRI_22
#define USBUART_arb_int__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_arb_int__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* USBUART_ord_int */
#define USBUART_ord_int__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_ord_int__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_ord_int__INTC_MASK 0x2000000u
#define USBUART_ord_int__INTC_NUMBER 25
#define USBUART_ord_int__INTC_PRIOR_NUM 7
#define USBUART_ord_int__INTC_PRIOR_REG CYREG_NVIC_PRI_25
#define USBUART_ord_int__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_ord_int__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* USBUART_sof_int */
#define USBUART_sof_int__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_sof_int__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_sof_int__INTC_MASK 0x800000u
#define USBUART_sof_int__INTC_NUMBER 23
#define USBUART_sof_int__INTC_PRIOR_NUM 7
#define USBUART_sof_int__INTC_PRIOR_REG CYREG_NVIC_PRI_23
#define USBUART_sof_int__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_sof_int__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* ISR_Debug_Fast */
#define ISR_Debug_Fast__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ISR_Debug_Fast__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ISR_Debug_Fast__INTC_MASK 0x1000u
#define ISR_Debug_Fast__INTC_NUMBER 12
#define ISR_Debug_Fast__INTC_PRIOR_NUM 7
#define ISR_Debug_Fast__INTC_PRIOR_REG CYREG_NVIC_PRI_12
#define ISR_Debug_Fast__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ISR_Debug_Fast__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

