MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* ISR_Debug_Slow */
#define ISR_Debug_Slow__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ISR_Debug_Slow__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ISR_Debug_Slow__INTC_MASK 0x200u
#define ISR_Debug_Slow__INTC_NUMBER 9
#define ISR_Debug_Slow__INTC_PRIOR_NUM 7
#define ISR_Debug_Slow__INTC_PRIOR_REG CYREG_NVIC_PRI_9
#define ISR_Debug_Slow__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ISR_Debug_Slow__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* Matrix_Channel */
#define Matrix_Channel_ctrl_reg__0__MASK 0x01u
#define Matrix_Channel_ctrl_reg__0__POS 0
#define Matrix_Channel_ctrl_reg__1__MASK 0x02u
#define Matrix_Channel_ctrl_reg__1__POS 1
#define Matrix_Channel_ctrl_reg__16BIT_CONTROL_AUX_CTL_REG CYREG_B0_UDB07_08_ACTL
#define Matrix_Channel_ctrl_reg__16BIT_CONTROL_CONTROL_REG CYREG_B0_UDB07_08_CTL
#define Matrix_Channel_ctrl_reg__16BIT_CONTROL_COUNT_REG CYREG_B0_UDB07_08_CTL
#define Matrix_Channel_ctrl_reg__16BIT_COUNT_CONTROL_REG CYREG_B0_UDB07_08_CTL
#define Matrix_Channel_ctrl_reg__16BIT_COUNT_COUNT_REG CYREG_B0_UDB07_08_CTL
#define Matrix_Channel_ctrl_reg__16BIT_MASK_MASK_REG CYREG_B0_UDB07_08_MSK
#define Matrix_Channel_ctrl_reg__16BIT_MASK_PERIOD_REG CYREG_B0_UDB07_08_MSK
#define Matrix_Channel_ctrl_reg__16BIT_PERIOD_MASK_REG CYREG_B0_UDB07_08_MSK
#define Matrix_Channel_ctrl_reg__16BIT_PERIOD_PERIOD_REG CYREG_B0_UDB07_08_MSK
#define Matrix_Channel_ctrl_reg__2__MASK 0x04u
#define Matrix_Channel_ctrl_reg__2__POS 2
#define Matrix_Channel_ctrl_reg__3__MASK 0x08u
#define Matrix_Channel_ctrl_reg__3__POS 3
#define Matrix_Channel_ctrl_reg__4__MASK 0x10u
#define Matrix_Channel_ctrl_reg__4__POS 4
#define Matrix_Channel_ctrl_reg__5__MASK 0x20u
#define Matrix_Channel_ctrl_reg__5__POS 5
#define Matrix_Channel_ctrl_reg__6__MASK 0x40u
#define Matrix_Channel_ctrl_reg__6__POS 6
#define Matrix_Channel_ctrl_reg__CONTROL_AUX_CTL_REG CYREG_B0_UDB07_ACTL
#define Matrix_Channel_ctrl_reg__CONTROL_REG CYREG_B0_UDB07_CTL
#define Matrix_Channel_ctrl_reg__CONTROL_ST_REG CYREG_B0_UDB07_ST_CTL
#define Matrix_Channel_ctrl_reg__COUNT_REG CYREG_B0_UDB07_CTL
#define Matrix_Channel_ctrl_reg__COUNT_ST_REG CYREG_B0_UDB07_ST_CTL
#define Matrix_Channel_ctrl_reg__MASK 0x7Fu
#define Matrix_Channel_ctrl_reg__MASK_CTL_AUX_CTL_REG CYREG_B0_UDB07_MSK_ACTL
#define Matrix_Channel_ctrl_reg__PER_CTL_AUX_CTL_REG CYREG_B0_UDB07_MSK_ACTL
#define Matrix_Channel_ctrl_reg__PERIOD_REG CYREG_B0_UDB07_MSK

/* VDAC8_0_viDAC8 */
#define VDAC8_0_viDAC8__CR0 CYREG_DAC0_CR0
#define VDAC8_0_viDAC8__CR1 CYREG_DAC0_CR1
#define VDAC8_0_viDAC8__D CYREG_DAC0_D
#define VDAC8_0_viDAC8__PM_ACT_CFG CYREG_PM_ACT_CFG8
#define VDAC8_0_viDAC8__PM_ACT_MSK 0x01u
#define VDAC8_0_viDAC8__PM_STBY_CFG CYREG_PM_STBY_CFG8
#define VDAC8_0_viDAC8__PM_STBY_MSK 0x01u
#define VDAC8_0_viDAC8__STROBE CYREG_DAC0_STROBE
#define VDAC8_0_viDAC8__SW0 CYREG_DAC0_SW0
#define VDAC8_0_viDAC8__SW2 CYREG_DAC0_SW2
#define VDAC8_0_viDAC8__SW3 CYREG_DAC0_SW3
#define VDAC8_0_viDAC8__SW4 CYREG_DAC0_SW4
#define VDAC8_0_viDAC8__TR CYREG_DAC0_TR
#define VDAC8_0_viDAC8__TRIM__M1 CYREG_FLSHID_CUST_TABLES_DAC0_M1
#define VDAC8_0_viDAC8__TRIM__M2 CYREG_FLSHID_CUST_TABLES_DAC0_M2
#define VDAC8_0_viDAC8__TRIM__M3 CYREG_FLSHID_CUST_TABLES_DAC0_M3
#define VDAC8_0_viDAC8__TRIM__M4 CYREG_FLSHID_CUST_TABLES_DAC0_M4
#define VDAC8_0_viDAC8__TRIM__M5 CYREG_FLSHID_CUST_TABLES_DAC0_M5
#define VDAC8_0_viDAC8__TRIM__M6 CYREG_FLSHID_CUST_TABLES_DAC0_M6
#define VDAC8_0_viDAC8__TRIM__M7 CYREG_FLSHID_CUST_TABLES_DAC0_M7
#define VDAC8_0_viDAC8__TRIM__M8 CYREG_FLSHID_CUST_TABLES_DAC0_M8
#define VDAC8_0_viDAC8__TRIM__TR CYREG_FLSHID_MFG_CFG_DAC0_TR
#define VDAC8_0_viDAC8__TST CYREG_DAC0_TST

/* ADC_SAR_A_IRQ */
#define ADC_SAR_A_IRQ__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ADC_SAR_A_IRQ__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ADC_SAR_A_IRQ__INTC_MASK 0x800u
#define ADC_SAR_A_IRQ__INTC_NUMBER 11
#define ADC_SAR_A_IRQ__INTC_PRIOR_NUM 7
#define ADC_SAR_A_IRQ__INTC_PRIOR_REG CYREG_NVIC_PRI_11
#define ADC_SAR_A_IRQ__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ADC_SAR_A_IRQ__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* ADC_SAR_B_IRQ */
#define ADC_SAR_B_IRQ__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ADC_SAR_B_IRQ__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ADC_SAR_B_IRQ__INTC_MASK 0x10000u
#define ADC_SAR_B_IRQ__INTC_NUMBER 16
#define ADC_SAR_B_IRQ__INTC_PRIOR_NUM 7
#define ADC_SAR_B_IRQ__INTC_PRIOR_REG CYREG_NVIC_PRI_16
#define ADC_SAR_B_IRQ__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ADC_SAR_B_IRQ__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* Pin_Debug_IRQ */
#define Pin_Debug_IRQ__0__MASK 0x80u
#define Pin_Debug_IRQ__0__PC CYREG_PRT1_PC7
#define Pin_Debug_IRQ__0__PORT 1
#define Pin_Debug_IRQ__0__SHIFT 7
#define Pin_Debug_IRQ__AG CYREG_PRT1_AG
#define Pin_Debug_IRQ__AMUX CYREG_PRT1_AMUX
#define Pin_Debug_IRQ__BIE CYREG_PRT1_BIE
#define Pin_Debug_IRQ__BIT_MASK CYREG_PRT1_BIT_MASK
#define Pin_Debug_IRQ__BYP CYREG_PRT1_BYP
#define Pin_Debug_IRQ__CTL CYREG_PRT1_CTL
#define Pin_Debug_IRQ__DM0 CYREG_PRT1_DM0
#define Pin_Debug_IRQ__DM1 CYREG_PRT1_DM1
#define Pin_Debug_IRQ__DM2 CYREG_PRT1_DM2
#define Pin_Debug_IRQ__DR CYREG_PRT1_DR
#define Pin_Debug_IRQ__INP_DIS CYREG_PRT1_INP_DIS
#define Pin_Debug_IRQ__LCD_COM_SEG CYREG_PRT1_LCD_COM_SEG
#define Pin_Debug_IRQ__LCD_EN CYREG_PRT1_LCD_EN
#define Pin_Debug_IRQ__MASK 0x80u
#define Pin_Debug_IRQ__PORT 1
#define Pin_Debug_IRQ__PRT CYREG_PRT1_PRT
#define Pin_Debug_IRQ__PRTDSI__CAPS_SEL CYREG_PRT1_CAPS_SEL
#define Pin_Debug_IRQ__PRTDSI__DBL_SYNC_IN CYREG_PRT1_DBL_SYNC_IN
#define Pin_Debug_IRQ__PRTDSI__OE_SEL0 CYREG_PRT1_OE_SEL0
#define Pin_Debug_IRQ__PRTDSI__OE_SEL1 CYREG_PRT1_OE_SEL1
#define Pin_Debug_IRQ__PRTDSI__OUT_SEL0 CYREG_PRT1_OUT_SEL0
#define Pin_Debug_IRQ__PRTDSI__OUT_SEL1 CYREG_PRT1_OUT_SEL1
#define Pin_Debug_IRQ__PRTDSI__SYNC_OUT CYREG_PRT1_SYNC_OUT
#define Pin_Debug_IRQ__PS CYREG_PRT1_PS
#define Pin_Debug_IRQ__SHIFT 7
#define Pin_Debug_IRQ__SLW CYREG_PRT1_SLW

/* DMA_Filter_A */
#define DMA_Filter_A__DRQ_CTL CYREG_IDMUX_DRQ_CTL2
#define DMA_Filter_A__DRQ_NUMBER 8
#define DMA_Filter_A__NUMBEROF_TDS 0
#define DMA_Filter_A__PRIORITY 2
#define DMA_Filter_A__TERMIN_EN 0
#define DMA_Filter_A__TERMIN_SEL 0
#define DMA_Filter_A__TERMOUT0_EN 0
#define DMA_Filter_A__TERMOUT0_SEL 0
#define DMA_Filter_A__TERMOUT1_EN 0
#define DMA_Filter_A__TERMOUT1_SEL 0

/* DMA_Filter_B */
#define DMA_Filter_B__DRQ_CTL CYREG_IDMUX_DRQ_CTL2
#define DMA_Filter_B__DRQ_NUMBER 9
#define DMA_Filter_B__NUMBEROF_TDS 0
#define DMA_Filter_B__PRIORITY 2
#define DMA_Filter_B__TERMIN_EN 0
#define DMA_Filter_B__TERMIN_SEL 0
#define DMA_Filter_B__TERMOUT0_EN 1
#define DMA_Filter_B__TERMOUT0_SEL 9
#define DMA_Filter_B__TERMOUT1_EN 1
#define DMA_Filter_B__TERMOUT1_SEL 10

