MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Opamp_A_ABuf */
#define Opamp_A_ABuf__CR CYREG_ABUF2_CR
#define Opamp_A_ABuf__MX CYREG_ABUF2_MX
#define Opamp_A_ABuf__NPUMP_ABUF_TR0 CYREG_NPUMP_ABUF_TR0
#define Opamp_A_ABuf__PM_ACT_CFG CYREG_PM_ACT_CFG4
#define Opamp_A_ABuf__PM_ACT_MSK 0x04u
#define Opamp_A_ABuf__PM_STBY_CFG CYREG_PM_STBY_CFG4
#define Opamp_A_ABuf__PM_STBY_MSK 0x04u
#define Opamp_A_ABuf__RSVD CYREG_ABUF2_RSVD
#define Opamp_A_ABuf__SW CYREG_ABUF2_SW
#define Opamp_A_ABuf__TR0 CYREG_ABUF2_TR0
#define Opamp_A_ABuf__TR1 CYREG_ABUF2_TR1

/* Opamp_B_ABuf */
#define Opamp_B_ABuf__CR CYREG_ABUF0_CR
#define Opamp_B_ABuf__MX CYREG_ABUF0_MX
#define Opamp_B_ABuf__NPUMP_ABUF_TR0 CYREG_NPUMP_ABUF_TR0
#define Opamp_B_ABuf__PM_ACT_CFG CYREG_PM_ACT_CFG4
#define Opamp_B_ABuf__PM_ACT_MSK 0x01u
#define Opamp_B_ABuf__PM_STBY_CFG CYREG_PM_STBY_CFG4
#define Opamp_B_ABuf__PM_STBY_MSK 0x01u
#define Opamp_B_ABuf__RSVD CYREG_ABUF0_RSVD
#define Opamp_B_ABuf__SW CYREG_ABUF0_SW
#define Opamp_B_ABuf__TR0 CYREG_ABUF0_TR0
#define Opamp_B_ABuf__TR1 CYREG_ABUF0_TR1

/* Pin_Reserved */
#define Pin_Reserved__0__MASK 0x01u
#define Pin_Reserved__0__PC CYREG_PRT15_PC0
#define Pin_Reserved__0__PORT 15
#define Pin_Reserved__0__SHIFT 0
#define Pin_Reserved__1__MASK 0x02u
#define Pin_Reserved__1__PC CYREG_PRT15_PC1
#define Pin_Reserved__1__PORT 15
#define Pin_Reserved__1__SHIFT 1
#define Pin_Reserved__2__MASK 0x04u
#define Pin_Reserved__2__PC CYREG_PRT15_PC2
#define Pin_Reserved__2__PORT 15
#define Pin_Reserved__2__SHIFT 2
#define Pin_Reserved__3__MASK 0x08u
#define Pin_Reserved__3__PC CYREG_PRT15_PC3
#define Pin_Reserved__3__PORT 15
#define Pin_Reserved__3__SHIFT 3
#define Pin_Reserved__4__MASK 0x10u
#define Pin_Reserved__4__PC CYREG_PRT15_PC4
#define Pin_Reserved__4__PORT 15
#define Pin_Reserved__4__SHIFT 4
#define Pin_Reserved__5__MASK 0x20u
#define Pin_Reserved__5__PC CYREG_PRT15_PC5
#define Pin_Reserved__5__PORT 15
#define Pin_Reserved__5__SHIFT 5
#define Pin_Reserved__AG CYREG_PRT15_AG
#define Pin_Reserved__AMUX CYREG_PRT15_AMUX
#define Pin_Reserved__BIE CYREG_PRT15_BIE
#define Pin_Reserved__BIT_MASK CYREG_PRT15_BIT_MASK
#define Pin_Reserved__BYP CYREG_PRT15_BYP
#define Pin_Reserved__CTL CYREG_PRT15_CTL
#define Pin_Reserved__DM0 CYREG_PRT15_DM0
#define Pin_Reserved__DM1 CYREG_PRT15_DM1
#define Pin_Reserved__DM2 CYREG_PRT15_DM2
#define Pin_Reserved__DR CYREG_PRT15_DR
#define Pin_Reserved__INP_DIS CYREG_PRT15_INP_DIS
#define Pin_Reserved__LCD_COM_SEG CYREG_PRT15_LCD_COM_SEG
#define Pin_Reserved__LCD_EN CYREG_PRT15_LCD_EN
#define Pin_Reserved__PORT 15
#define Pin_Reserved__PRT CYREG_PRT15_PRT
#define Pin_Reserved__PRTDSI__CAPS_SEL CYREG_PRT15_CAPS_SEL
#define Pin_Reserved__PRTDSI__DBL_SYNC_IN CYREG_PRT15_DBL_SYNC_IN
#define Pin_Reserved__PRTDSI__OE_SEL0 CYREG_PRT15_OE_SEL0
#define Pin_Reserved__PRTDSI__OE_SEL1 CYREG_PRT15_OE_SEL1
#define Pin_Reserved__PRTDSI__OUT_SEL0 CYREG_PRT15_OUT_SEL0
#define Pin_Reserved__PRTDSI__OUT_SEL1 CYREG_PRT15_OUT_SEL1
#define Pin_Reserved__PRTDSI__SYNC_OUT CYREG_PRT15_SYNC_OUT
#define Pin_Reserved__PS CYREG_PRT15_PS
#define Pin_Reserved__SLW CYREG_PRT15_SLW

/* Pin_Row_IO_A */
#define Pin_Row_IO_A__0__MASK 0x40u
#define Pin_Row_IO_A__0__PC CYREG_PRT0_PC6
#define Pin_Row_IO_A__0__PORT 0
#define Pin_Row_IO_A__0__SHIFT 6
#define Pin_Row_IO_A__AG CYREG_PRT0_AG
#define Pin_Row_IO_A__AMUX CYREG_PRT0_AMUX
#define Pin_Row_IO_A__BIE CYREG_PRT0_BIE
#define Pin_Row_IO_A__BIT_MASK CYREG_PRT0_BIT_MASK
#define Pin_Row_IO_A__BYP CYREG_PRT0_BYP
#define Pin_Row_IO_A__CTL CYREG_PRT0_CTL
#define Pin_Row_IO_A__DM0 CYREG_PRT0_DM0
#define Pin_Row_IO_A__DM1 CYREG_PRT0_DM1
#define Pin_Row_IO_A__DM2 CYREG_PRT0_DM2
#define Pin_Row_IO_A__DR CYREG_PRT0_DR
#define Pin_Row_IO_A__INP_DIS CYREG_PRT0_INP_DIS
#define Pin_Row_IO_A__LCD_COM_SEG CYREG_PRT0_LCD_COM_SEG
#define Pin_Row_IO_A__LCD_EN CYREG_PRT0_LCD_EN
#define Pin_Row_IO_A__PORT 0
#define Pin_Row_IO_A__PRT CYREG_PRT0_PRT
#define Pin_Row_IO_A__PRTDSI__CAPS_SEL CYREG_PRT0_CAPS_SEL
#define Pin_Row_IO_A__PRTDSI__DBL_SYNC_IN CYREG_PRT0_DBL_SYNC_IN
#define Pin_Row_IO_A__PRTDSI__OE_SEL0 CYREG_PRT0_OE_SEL0
#define Pin_Row_IO_A__PRTDSI__OE_SEL1 CYREG_PRT0_OE_SEL1
#define Pin_Row_IO_A__PRTDSI__OUT_SEL0 CYREG_PRT0_OUT_SEL0
#define Pin_Row_IO_A__PRTDSI__OUT_SEL1 CYREG_PRT0_OUT_SEL1
#define Pin_Row_IO_A__PRTDSI__SYNC_OUT CYREG_PRT0_SYNC_OUT
#define Pin_Row_IO_A__PS CYREG_PRT0_PS
#define Pin_Row_IO_A__SLW CYREG_PRT0_SLW

/* Pin_Row_IO_B */
#define Pin_Row_IO_B__0__MASK 0x40u
#define Pin_Row_IO_B__0__PC CYREG_PRT1_PC6
#define Pin_Row_IO_B__0__PORT 1
#define Pin_Row_IO_B__0__SHIFT 6
#define Pin_Row_IO_B__AG CYREG_PRT1_AG
#define Pin_Row_IO_B__AMUX CYREG_PRT1_AMUX
#define Pin_Row_IO_B__BIE CYREG_PRT1_BIE
#define Pin_Row_IO_B__BIT_MASK CYREG_PRT1_BIT_MASK
#define Pin_Row_IO_B__BYP CYREG_PRT1_BYP
#define Pin_Row_IO_B__CTL CYREG_PRT1_CTL
#define Pin_Row_IO_B__DM0 CYREG_PRT1_DM0
#define Pin_Row_IO_B__DM1 CYREG_PRT1_DM1
#define Pin_Row_IO_B__DM2 CYREG_PRT1_DM2
#define Pin_Row_IO_B__DR CYREG_PRT1_DR
#define Pin_Row_IO_B__INP_DIS CYREG_PRT1_INP_DIS
#define Pin_Row_IO_B__LCD_COM_SEG CYREG_PRT1_LCD_COM_SEG
#define Pin_Row_IO_B__LCD_EN CYREG_PRT1_LCD_EN
#define Pin_Row_IO_B__PORT 1
#define Pin_Row_IO_B__PRT CYREG_PRT1_PRT
#define Pin_Row_IO_B__PRTDSI__CAPS_SEL CYREG_PRT1_CAPS_SEL
#define Pin_Row_IO_B__PRTDSI__DBL_SYNC_IN CYREG_PRT1_DBL_SYNC_IN
#define Pin_Row_IO_B__PRTDSI__OE_SEL0 CYREG_PRT1_OE_SEL0
#define Pin_Row_IO_B__PRTDSI__OE_SEL1 CYREG_PRT1_OE_SEL1
#define Pin_Row_IO_B__PRTDSI__OUT_SEL0 CYREG_PRT1_OUT_SEL0
#define Pin_Row_IO_B__PRTDSI__OUT_SEL1 CYREG_PRT1_OUT_SEL1
#define Pin_Row_IO_B__PRTDSI__SYNC_OUT CYREG_PRT1_SYNC_OUT
#define Pin_Row_IO_B__PS CYREG_PRT1_PS
#define Pin_Row_IO_B__SLW CYREG_PRT1_SLW

/* USBUART_ep_0 */
#define USBUART_ep_0__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_ep_0__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_ep_0__INTC_MASK 0x4000000u
#define USBUART_ep_0__INTC_NUMBER 26
#define USBUART_ep_0__INTC_PRIOR_NUM 7
#define USBUART_ep_0__INTC_PRIOR_REG CYREG_NVIC_PRI_26
#define USBUART_ep_0__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_ep_0__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* USBUART_ep_1 */
#define USBUART_ep_1__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define USBUART_ep_1__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define USBUART_ep_1__INTC_MASK 0x20000000u
#define USBUART_ep_1__INTC_NUMBER 29
#define USBUART_ep_1__INTC_PRIOR_NUM 7
#define USBUART_ep_1__INTC_PRIOR_REG CYREG_NVIC_PRI_29
#define USBUART_ep_1__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define USBUART_ep_1__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

