MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Filter_DFB */
#define Filter_DFB__ACU_SRAM_DATA CYREG_DFB0_ACU_SRAM_DATA_MBASE
#define Filter_DFB__COHER CYREG_DFB0_COHER
#define Filter_DFB__CR CYREG_DFB0_CR
#define Filter_DFB__CSA_SRAM_DATA CYREG_DFB0_CSA_SRAM_DATA_MBASE
#define Filter_DFB__CSB_SRAM_DATA CYREG_DFB0_CSB_SRAM_DATA_MBASE
#define Filter_DFB__DALIGN CYREG_DFB0_DALIGN
#define Filter_DFB__DMA_CTRL CYREG_DFB0_DMA_CTRL
#define Filter_DFB__DPA_SRAM_DATA CYREG_DFB0_DPA_SRAM_DATA_MBASE
#define Filter_DFB__DPB_SRAM_DATA CYREG_DFB0_DPB_SRAM_DATA_MBASE
#define Filter_DFB__DSI_CTRL CYREG_DFB0_DSI_CTRL
#define Filter_DFB__FSM_SRAM_DATA CYREG_DFB0_FSM_SRAM_DATA_MBASE
#define Filter_DFB__HOLDA CYREG_DFB0_HOLDA
#define Filter_DFB__HOLDAH CYREG_DFB0_HOLDAH
#define Filter_DFB__HOLDAM CYREG_DFB0_HOLDAM
#define Filter_DFB__HOLDAS CYREG_DFB0_HOLDAS
#define Filter_DFB__HOLDB CYREG_DFB0_HOLDB
#define Filter_DFB__HOLDBH CYREG_DFB0_HOLDBH
#define Filter_DFB__HOLDBM CYREG_DFB0_HOLDBM
#define Filter_DFB__HOLDBS CYREG_DFB0_HOLDBS
#define Filter_DFB__INT_CTRL CYREG_DFB0_INT_CTRL
#define Filter_DFB__PM_ACT_CFG CYREG_PM_ACT_CFG6
#define Filter_DFB__PM_ACT_MSK 0x10u
#define Filter_DFB__PM_STBY_CFG CYREG_PM_STBY_CFG6
#define Filter_DFB__PM_STBY_MSK 0x10u
#define Filter_DFB__RAM_DIR CYREG_DFB0_RAM_DIR
#define Filter_DFB__RAM_EN CYREG_DFB0_RAM_EN
#define Filter_DFB__SEMA CYREG_DFB0_SEMA
#define Filter_DFB__SR CYREG_DFB0_SR
#define Filter_DFB__STAGEA CYREG_DFB0_STAGEA
#define Filter_DFB__STAGEAH CYREG_DFB0_STAGEAH
#define Filter_DFB__STAGEAM CYREG_DFB0_STAGEAM
#define Filter_DFB__STAGEB CYREG_DFB0_STAGEB
#define Filter_DFB__STAGEBH CYREG_DFB0_STAGEBH
#define Filter_DFB__STAGEBM CYREG_DFB0_STAGEBM

/* ISR_Matrix */
#define ISR_Matrix__INTC_CLR_EN_REG CYREG_NVIC_CLRENA0
#define ISR_Matrix__INTC_CLR_PD_REG CYREG_NVIC_CLRPEND0
#define ISR_Matrix__INTC_MASK 0x02u
#define ISR_Matrix__INTC_NUMBER 1
#define ISR_Matrix__INTC_PRIOR_NUM 7
#define ISR_Matrix__INTC_PRIOR_REG CYREG_NVIC_PRI_1
#define ISR_Matrix__INTC_SET_EN_REG CYREG_NVIC_SETENA0
#define ISR_Matrix__INTC_SET_PD_REG CYREG_NVIC_SETPEND0

/* USBUART_dm */
#define USBUART_dm__0__MASK 0x80u
#define USBUART_dm__0__PC CYREG_PRT15_PC7
#define USBUART_dm__0__PORT 15
#define USBUART_dm__0__SHIFT 7
#define USBUART_dm__AG CYREG_PRT15_AG
#define USBUART_dm__AMUX CYREG_PRT15_AMUX
#define USBUART_dm__BIE CYREG_PRT15_BIE
#define USBUART_dm__BIT_MASK CYREG_PRT15_BIT_MASK
#define USBUART_dm__BYP CYREG_PRT15_BYP
#define USBUART_dm__CTL CYREG_PRT15_CTL
#define USBUART_dm__dm__MASK 0x80u
#define USBUART_dm__dm__PC CYREG_PRT15_PC7
#define USBUART_dm__dm__PORT 15
#define USBUART_dm__dm__SHIFT 7
#define USBUART_dm__DM0 CYREG_PRT15_DM0
#define USBUART_dm__DM1 CYREG_PRT15_DM1
#define USBUART_dm__DM2 CYREG_PRT15_DM2
#define USBUART_dm__DR CYREG_PRT15_DR
#define USBUART_dm__INP_DIS CYREG_PRT15_INP_DIS
#define USBUART_dm__LCD_COM_SEG CYREG_PRT15_LCD_COM_SEG
#define USBUART_dm__LCD_EN CYREG_PRT15_LCD_EN
#define USBUART_dm__PORT 15
#define USBUART_dm__PRT CYREG_PRT15_PRT
#define USBUART_dm__PRTDSI__CAPS_SEL CYREG_PRT15_CAPS_SEL
#define USBUART_dm__PRTDSI__DBL_SYNC_IN CYREG_PRT15_DBL_SYNC_IN
#define USBUART_dm__PRTDSI__OE_SEL0 CYREG_PRT15_OE_SEL0
#define USBUART_dm__PRTDSI__OE_SEL1 CYREG_PRT15_OE_SEL1
#define USBUART_dm__PRTDSI__OUT_SEL0 CYREG_PRT15_OUT_SEL0
#define USBUART_dm__PRTDSI__OUT_SEL1 CYREG_PRT15_OUT_SEL1
#define USBUART_dm__PRTDSI__SYNC_OUT CYREG_PRT15_SYNC_OUT
#define USBUART_dm__PS CYREG_PRT15_PS
#define USBUART_dm__SLW CYREG_PRT15_SLW

/* USBUART_dp */
#define USBUART_dp__0__MASK 0x40u
#define USBUART_dp__0__PC CYREG_PRT15_PC6
#define USBUART_dp__0__PORT 15
#define USBUART_dp__0__SHIFT 6
#define USBUART_dp__AG CYREG_PRT15_AG
#define USBUART_dp__AMUX CYREG_PRT15_AMUX
#define USBUART_dp__BIE CYREG_PRT15_BIE
#define USBUART_dp__BIT_MASK CYREG_PRT15_BIT_MASK
#define USBUART_dp__BYP CYREG_PRT15_BYP
#define USBUART_dp__CTL CYREG_PRT15_CTL
#define USBUART_dp__DM0 CYREG_PRT15_DM0
#define USBUART_dp__DM1 CYREG_PRT15_DM1
#define USBUART_dp__DM2 CYREG_PRT15_DM2
#define USBUART_dp__dp__MASK 0x40u
#define USBUART_dp__dp__PC CYREG_PRT15_PC6
#define USBUART_dp__dp__PORT 15
#define USBUART_dp__dp__SHIFT 6
#define USBUART_dp__DR CYREG_PRT15_DR
#define USBUART_dp__INP_DIS CYREG_PRT15_INP_DIS
#define USBUART_dp__LCD_COM_SEG CYREG_PRT15_LCD_COM_SEG
#define USBUART_dp__LCD_EN CYREG_PRT15_LCD_EN
#define USBUART_dp__PORT 15
#define USBUART_dp__PRT CYREG_PRT15_PRT
#define USBUART_dp__PRTDSI__CAPS_SEL CYREG_PRT15_CAPS_SEL
#define USBUART_dp__PRTDSI__DBL_SYNC_IN CYREG_PRT15_DBL_SYNC_IN
#define USBUART_dp__PRTDSI__OE_SEL0 CYREG_PRT15_OE_SEL0
#define USBUART_dp__PRTDSI__OE_SEL1 CYREG_PRT15_OE_SEL1
#define USBUART_dp__PRTDSI__OUT_SEL0 CYREG_PRT15_OUT_SEL0
#define USBUART_dp__PRTDSI__OUT_SEL1 CYREG_PRT15_OUT_SEL1
#define USBUART_dp__PRTDSI__SYNC_OUT CYREG_PRT15_SYNC_OUT
#define USBUART_dp__PS CYREG_PRT15_PS
#define USBUART_dp__SLW CYREG_PRT15_SLW

/* DMA_ADC_A */
#define DMA_ADC_A__DRQ_CTL CYREG_IDMUX_DRQ_CTL3
#define DMA_ADC_A__DRQ_NUMBER 12
#define DMA_ADC_A__NUMBEROF_TDS 0
#define DMA_ADC_A__PRIORITY 2
#define DMA_ADC_A__TERMIN_EN 0
#define DMA_ADC_A__TERMIN_SEL 0
#define DMA_ADC_A__TERMOUT0_EN 1
#define DMA_ADC_A__TERMOUT0_SEL 12
#define DMA_ADC_A__TERMOUT1_EN 1
#define DMA_ADC_A__TERMOUT1_SEL 6

/* DMA_ADC_B */
#define DMA_ADC_B__DRQ_CTL CYREG_IDMUX_DRQ_CTL3
#define DMA_ADC_B__DRQ_NUMBER 13
#define DMA_ADC_B__NUMBEROF_TDS 0
#define DMA_ADC_B__PRIORITY 2
#define DMA_ADC_B__TERMIN_EN 0
#define DMA_ADC_B__TERMIN_SEL 0
#define DMA_ADC_B__TERMOUT0_EN 0
#define DMA_ADC_B__TERMOUT0_SEL 0
#define DMA_ADC_B__TERMOUT1_EN 0
#define DMA_ADC_B__TERMOUT1_SEL 0

/* DMA_Debug */
#define DMA_Debug__DRQ_CTL CYREG_IDMUX_DRQ_CTL0
#define DMA_Debug__DRQ_NUMBER 2
#define DMA_Debug__NUMBEROF_TDS 0
#define DMA_Debug__PRIORITY 2
#define DMA_Debug__TERMIN_EN 0
#define DMA_Debug__TERMIN_SEL 0
#define DMA_Debug__TERMOUT0_EN 0
#define DMA_Debug__TERMOUT0_SEL 0
#define DMA_Debug__TERMOUT1_EN 0
#define DMA_Debug__TERMOUT1_SEL 0

/* Matrix_CR */
#define Matrix_CR_ctrl_reg__0__MASK 0x01u
#define Matrix_CR_ctrl_reg__0__POS 0
#define Matrix_CR_ctrl_reg__1__MASK 0x02u
#define Matrix_CR_ctrl_reg__1__POS 1
#define Matrix_CR_ctrl_reg__16BIT_CONTROL_AUX_CTL_REG CYREG_B0_UDB06_07_ACTL
#define Matrix_CR_ctrl_reg__16BIT_CONTROL_CONTROL_REG CYREG_B0_UDB06_07_CTL
#define Matrix_CR_ctrl_reg__16BIT_CONTROL_COUNT_REG CYREG_B0_UDB06_07_CTL
#define Matrix_CR_ctrl_reg__16BIT_COUNT_CONTROL_REG CYREG_B0_UDB06_07_CTL
#define Matrix_CR_ctrl_reg__16BIT_COUNT_COUNT_REG CYREG_B0_UDB06_07_CTL
#define Matrix_CR_ctrl_reg__16BIT_MASK_MASK_REG CYREG_B0_UDB06_07_MSK
#define Matrix_CR_ctrl_reg__16BIT_MASK_PERIOD_REG CYREG_B0_UDB06_07_MSK
#define Matrix_CR_ctrl_reg__16BIT_PERIOD_MASK_REG CYREG_B0_UDB06_07_MSK
#define Matrix_CR_ctrl_reg__16BIT_PERIOD_PERIOD_REG CYREG_B0_UDB06_07_MSK
#define Matrix_CR_ctrl_reg__2__MASK 0x04u
#define Matrix_CR_ctrl_reg__2__POS 2
#define Matrix_CR_ctrl_reg__CONTROL_AUX_CTL_REG CYREG_B0_UDB06_ACTL
#define Matrix_CR_ctrl_reg__CONTROL_REG CYREG_B0_UDB06_CTL
#define Matrix_CR_ctrl_reg__CONTROL_ST_REG CYREG_B0_UDB06_ST_CTL
#define Matrix_CR_ctrl_reg__COUNT_REG CYREG_B0_UDB06_CTL
#define Matrix_CR_ctrl_reg__COUNT_ST_REG CYREG_B0_UDB06_ST_CTL
#define Matrix_CR_ctrl_reg__MASK 0x07u
#define Matrix_CR_ctrl_reg__MASK_CTL_AUX_CTL_REG CYREG_B0_UDB06_MSK_ACTL
#define Matrix_CR_ctrl_reg__PER_CTL_AUX_CTL_REG CYREG_B0_UDB06_MSK_ACTL
#define Matrix_CR_ctrl_reg__PERIOD_REG CYREG_B0_UDB06_MSK

