MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Matrix_SR */
#define Matrix_SR_sts_reg__16BIT_STATUS_AUX_CTL_REG CYREG_B0_UDB14_15_ACTL
#define Matrix_SR_sts_reg__16BIT_STATUS_REG CYREG_B0_UDB14_15_ST
#define Matrix_SR_sts_reg__MASK 0x00u
#define Matrix_SR_sts_reg__MASK_REG CYREG_B0_UDB14_MSK
#define Matrix_SR_sts_reg__STATUS_AUX_CTL_REG CYREG_B0_UDB14_ACTL
#define Matrix_SR_sts_reg__STATUS_REG CYREG_B0_UDB14_ST

/* Pin_Debug */
#define Pin_Debug__0__MASK 0x80u
#define Pin_Debug__0__PC CYREG_PRT3_PC7
#define Pin_Debug__0__PORT 3
#define Pin_Debug__0__SHIFT 7
#define Pin_Debug__AG CYREG_PRT3_AG
#define Pin_Debug__AMUX CYREG_PRT3_AMUX
#define Pin_Debug__BIE CYREG_PRT3_BIE
#define Pin_Debug__BIT_MASK CYREG_PRT3_BIT_MASK
#define Pin_Debug__BYP CYREG_PRT3_BYP
#define Pin_Debug__CTL CYREG_PRT3_CTL
#define Pin_Debug__DM0 CYREG_PRT3_DM0
#define Pin_Debug__DM1 CYREG_PRT3_DM1
#define Pin_Debug__DM2 CYREG_PRT3_DM2
#define Pin_Debug__DR CYREG_PRT3_DR
#define Pin_Debug__INP_DIS CYREG_PRT3_INP_DIS
#define Pin_Debug__LCD_COM_SEG CYREG_PRT3_LCD_COM_SEG
#define Pin_Debug__LCD_EN CYREG_PRT3_LCD_EN
#define Pin_Debug__PORT 3
#define Pin_Debug__PRT CYREG_PRT3_PRT
#define Pin_Debug__PRTDSI__CAPS_SEL CYREG_PRT3_CAPS_SEL
#define Pin_Debug__PRTDSI__DBL_SYNC_IN CYREG_PRT3_DBL_SYNC_IN
#define Pin_Debug__PRTDSI__OE_SEL0 CYREG_PRT3_OE_SEL0
#define Pin_Debug__PRTDSI__OE_SEL1 CYREG_PRT3_OE_SEL1
#define Pin_Debug__PRTDSI__OUT_SEL0 CYREG_PRT3_OUT_SEL0
#define Pin_Debug__PRTDSI__OUT_SEL1 CYREG_PRT3_OUT_SEL1
#define Pin_Debug__PRTDSI__SYNC_OUT CYREG_PRT3_SYNC_OUT
#define Pin_Debug__PS CYREG_PRT3_PS
#define Pin_Debug__SLW CYREG_PRT3_SLW

/* Pin_Row_A */
#define Pin_Row_A__0__MASK 0x01u
#define Pin_Row_A__0__PC CYREG_PRT4_PC0
#define Pin_Row_A__0__PORT 4
#define Pin_Row_A__0__SHIFT 0
#define Pin_Row_A__1__MASK 0x04u
#define Pin_Row_A__1__PC CYREG_PRT4_PC2
#define Pin_Row_A__1__PORT 4
#define Pin_Row_A__1__SHIFT 2
#define Pin_Row_A__2__MASK 0x10u
#define Pin_Row_A__2__PC CYREG_PRT4_PC4
#define Pin_Row_A__2__PORT 4
#define Pin_Row_A__2__SHIFT 4
#define Pin_Row_A__3__MASK 0x40u
#define Pin_Row_A__3__PC CYREG_PRT4_PC6
#define Pin_Row_A__3__PORT 4
#define Pin_Row_A__3__SHIFT 6
#define Pin_Row_A__4__MASK 0x02u
#define Pin_Row_A__4__PC CYREG_PRT4_PC1
#define Pin_Row_A__4__PORT 4
#define Pin_Row_A__4__SHIFT 1
#define Pin_Row_A__5__MASK 0x08u
#define Pin_Row_A__5__PC CYREG_PRT4_PC3
#define Pin_Row_A__5__PORT 4
#define Pin_Row_A__5__SHIFT 3
#define Pin_Row_A__6__MASK 0x20u
#define Pin_Row_A__6__PC CYREG_PRT4_PC5
#define Pin_Row_A__6__PORT 4
#define Pin_Row_A__6__SHIFT 5
#define Pin_Row_A__7__MASK 0x80u
#define Pin_Row_A__7__PC CYREG_PRT4_PC7
#define Pin_Row_A__7__PORT 4
#define Pin_Row_A__7__SHIFT 7
#define Pin_Row_A__AG CYREG_PRT4_AG
#define Pin_Row_A__AMUX CYREG_PRT4_AMUX
#define Pin_Row_A__BIE CYREG_PRT4_BIE
#define Pin_Row_A__BIT_MASK CYREG_PRT4_BIT_MASK
#define Pin_Row_A__BYP CYREG_PRT4_BYP
#define Pin_Row_A__CTL CYREG_PRT4_CTL
#define Pin_Row_A__DM0 CYREG_PRT4_DM0
#define Pin_Row_A__DM1 CYREG_PRT4_DM1
#define Pin_Row_A__DM2 CYREG_PRT4_DM2
#define Pin_Row_A__DR CYREG_PRT4_DR
#define Pin_Row_A__INP_DIS CYREG_PRT4_INP_DIS
#define Pin_Row_A__LCD_COM_SEG CYREG_PRT4_LCD_COM_SEG
#define Pin_Row_A__LCD_EN CYREG_PRT4_LCD_EN
#define Pin_Row_A__PORT 4
#define Pin_Row_A__PRT CYREG_PRT4_PRT
#define Pin_Row_A__PRTDSI__CAPS_SEL CYREG_PRT4_CAPS_SEL
#define Pin_Row_A__PRTDSI__DBL_SYNC_IN CYREG_PRT4_DBL_SYNC_IN
#define Pin_Row_A__PRTDSI__OE_SEL0 CYREG_PRT4_OE_SEL0
#define Pin_Row_A__PRTDSI__OE_SEL1 CYREG_PRT4_OE_SEL1
#define Pin_Row_A__PRTDSI__OUT_SEL0 CYREG_PRT4_OUT_SEL0
#define Pin_Row_A__PRTDSI__OUT_SEL1 CYREG_PRT4_OUT_SEL1
#define Pin_Row_A__PRTDSI__SYNC_OUT CYREG_PRT4_SYNC_OUT
#define Pin_Row_A__PS CYREG_PRT4_PS
#define Pin_Row_A__SLW CYREG_PRT4_SLW

/* Pin_Row_B */
#define Pin_Row_B__0__MASK 0x01u
#define Pin_Row_B__0__PC CYREG_PRT5_PC0
#define Pin_Row_B__0__PORT 5
#define Pin_Row_B__0__SHIFT 0
#define Pin_Row_B__1__MASK 0x04u
#define Pin_Row_B__1__PC CYREG_PRT5_PC2
#define Pin_Row_B__1__PORT 5
#define Pin_Row_B__1__SHIFT 2
#define Pin_Row_B__2__MASK 0x10u
#define Pin_Row_B__2__PC CYREG_PRT5_PC4
#define Pin_Row_B__2__PORT 5
#define Pin_Row_B__2__SHIFT 4
#define Pin_Row_B__3__MASK 0x40u
#define Pin_Row_B__3__PC CYREG_PRT5_PC6
#define Pin_Row_B__3__PORT 5
#define Pin_Row_B__3__SHIFT 6
#define Pin_Row_B__4__MASK 0x02u
#define Pin_Row_B__4__PC CYREG_PRT5_PC1
#define Pin_Row_B__4__PORT 5
#define Pin_Row_B__4__SHIFT 1
#define Pin_Row_B__5__MASK 0x08u
#define Pin_Row_B__5__PC CYREG_PRT5_PC3
#define Pin_Row_B__5__PORT 5
#define Pin_Row_B__5__SHIFT 3
#define Pin_Row_B__6__MASK 0x20u
#define Pin_Row_B__6__PC CYREG_PRT5_PC5
#define Pin_Row_B__6__PORT 5
#define Pin_Row_B__6__SHIFT 5
#define Pin_Row_B__7__MASK 0x80u
#define Pin_Row_B__7__PC CYREG_PRT5_PC7
#define Pin_Row_B__7__PORT 5
#define Pin_Row_B__7__SHIFT 7
#define Pin_Row_B__AG CYREG_PRT5_AG
#define Pin_Row_B__AMUX CYREG_PRT5_AMUX
#define Pin_Row_B__BIE CYREG_PRT5_BIE
#define Pin_Row_B__BIT_MASK CYREG_PRT5_BIT_MASK
#define Pin_Row_B__BYP CYREG_PRT5_BYP
#define Pin_Row_B__CTL CYREG_PRT5_CTL
#define Pin_Row_B__DM0 CYREG_PRT5_DM0
#define Pin_Row_B__DM1 CYREG_PRT5_DM1
#define Pin_Row_B__DM2 CYREG_PRT5_DM2
#define Pin_Row_B__DR CYREG_PRT5_DR
#define Pin_Row_B__INP_DIS CYREG_PRT5_INP_DIS
#define Pin_Row_B__LCD_COM_SEG CYREG_PRT5_LCD_COM_SEG
#define Pin_Row_B__LCD_EN CYREG_PRT5_LCD_EN
#define Pin_Row_B__PORT 5
#define Pin_Row_B__PRT CYREG_PRT5_PRT
#define Pin_Row_B__PRTDSI__CAPS_SEL CYREG_PRT5_CAPS_SEL
#define Pin_Row_B__PRTDSI__DBL_SYNC_IN CYREG_PRT5_DBL_SYNC_IN
#define Pin_Row_B__PRTDSI__OE_SEL0 CYREG_PRT5_OE_SEL0
#define Pin_Row_B__PRTDSI__OE_SEL1 CYREG_PRT5_OE_SEL1
#define Pin_Row_B__PRTDSI__OUT_SEL0 CYREG_PRT5_OUT_SEL0
#define Pin_Row_B__PRTDSI__OUT_SEL1 CYREG_PRT5_OUT_SEL1
#define Pin_Row_B__PRTDSI__SYNC_OUT CYREG_PRT5_SYNC_OUT
#define Pin_Row_B__PS CYREG_PRT5_PS
#define Pin_Row_B__SLW CYREG_PRT5_SLW

