MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Pin_Vref */
#define Pin_Vref__0__MASK 0x40u
#define Pin_Vref__0__PC CYREG_PRT3_PC6
#define Pin_Vref__0__PORT 3
#define Pin_Vref__0__SHIFT 6
#define Pin_Vref__AG CYREG_PRT3_AG
#define Pin_Vref__AMUX CYREG_PRT3_AMUX
#define Pin_Vref__BIE CYREG_PRT3_BIE
#define Pin_Vref__BIT_MASK CYREG_PRT3_BIT_MASK
#define Pin_Vref__BYP CYREG_PRT3_BYP
#define Pin_Vref__CTL CYREG_PRT3_CTL
#define Pin_Vref__DM0 CYREG_PRT3_DM0
#define Pin_Vref__DM1 CYREG_PRT3_DM1
#define Pin_Vref__DM2 CYREG_PRT3_DM2
#define Pin_Vref__DR CYREG_PRT3_DR
#define Pin_Vref__INP_DIS CYREG_PRT3_INP_DIS
#define Pin_Vref__LCD_COM_SEG CYREG_PRT3_LCD_COM_SEG
#define Pin_Vref__LCD_EN CYREG_PRT3_LCD_EN
#define Pin_Vref__PORT 3
#define Pin_Vref__PRT CYREG_PRT3_PRT
#define Pin_Vref__PRTDSI__CAPS_SEL CYREG_PRT3_CAPS_SEL
#define Pin_Vref__PRTDSI__DBL_SYNC_IN CYREG_PRT3_DBL_SYNC_IN
#define Pin_Vref__PRTDSI__OE_SEL0 CYREG_PRT3_OE_SEL0
#define Pin_Vref__PRTDSI__OE_SEL1 CYREG_PRT3_OE_SEL1
#define Pin_Vref__PRTDSI__OUT_SEL0 CYREG_PRT3_OUT_SEL0
#define Pin_Vref__PRTDSI__OUT_SEL1 CYREG_PRT3_OUT_SEL1
#define Pin_Vref__PRTDSI__SYNC_OUT CYREG_PRT3_SYNC_OUT
#define Pin_Vref__PS CYREG_PRT3_PS
#define Pin_Vref__SLW CYREG_PRT3_SLW

/* Pin_Col */
#define Pin_Col__0__AG CYREG_PRT6_AG
#define Pin_Col__0__AMUX CYREG_PRT6_AMUX
#define Pin_Col__0__BIE CYREG_PRT6_BIE
#define Pin_Col__0__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__0__BYP CYREG_PRT6_BYP
#define Pin_Col__0__CTL CYREG_PRT6_CTL
#define Pin_Col__0__DM0 CYREG_PRT6_DM0
#define Pin_Col__0__DM1 CYREG_PRT6_DM1
#define Pin_Col__0__DM2 CYREG_PRT6_DM2
#define Pin_Col__0__DR CYREG_PRT6_DR
#define Pin_Col__0__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__0__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__0__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__0__MASK 0x01u
#define Pin_Col__0__PC CYREG_PRT6_PC0
#define Pin_Col__0__PORT 6
#define Pin_Col__0__PRT CYREG_PRT6_PRT
#define Pin_Col__0__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__0__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__0__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__0__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__0__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__0__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__0__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__0__PS CYREG_PRT6_PS
#define Pin_Col__0__SHIFT 0
#define Pin_Col__0__SLW CYREG_PRT6_SLW
#define Pin_Col__1__AG CYREG_PRT6_AG
#define Pin_Col__1__AMUX CYREG_PRT6_AMUX
#define Pin_Col__1__BIE CYREG_PRT6_BIE
#define Pin_Col__1__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__1__BYP CYREG_PRT6_BYP
#define Pin_Col__1__CTL CYREG_PRT6_CTL
#define Pin_Col__1__DM0 CYREG_PRT6_DM0
#define Pin_Col__1__DM1 CYREG_PRT6_DM1
#define Pin_Col__1__DM2 CYREG_PRT6_DM2
#define Pin_Col__1__DR CYREG_PRT6_DR
#define Pin_Col__1__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__1__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__1__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__1__MASK 0x04u
#define Pin_Col__1__PC CYREG_PRT6_PC2
#define Pin_Col__1__PORT 6
#define Pin_Col__1__PRT CYREG_PRT6_PRT
#define Pin_Col__1__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__1__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__1__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__1__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__1__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__1__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__1__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__1__PS CYREG_PRT6_PS
#define Pin_Col__1__SHIFT 2
#define Pin_Col__1__SLW CYREG_PRT6_SLW
#define Pin_Col__10__AG CYREG_PRT12_AG
#define Pin_Col__10__BIE CYREG_PRT12_BIE
#define Pin_Col__10__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__10__BYP CYREG_PRT12_BYP
#define Pin_Col__10__DM0 CYREG_PRT12_DM0
#define Pin_Col__10__DM1 CYREG_PRT12_DM1
#define Pin_Col__10__DM2 CYREG_PRT12_DM2
#define Pin_Col__10__DR CYREG_PRT12_DR
#define Pin_Col__10__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__10__MASK 0x04u
#define Pin_Col__10__PC CYREG_PRT12_PC2
#define Pin_Col__10__PORT 12
#define Pin_Col__10__PRT CYREG_PRT12_PRT
#define Pin_Col__10__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__10__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__10__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__10__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__10__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__10__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__10__PS CYREG_PRT12_PS
#define Pin_Col__10__SHIFT 2
#define Pin_Col__10__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__10__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__10__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__10__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__10__SLW CYREG_PRT12_SLW
#define Pin_Col__11__AG CYREG_PRT12_AG
#define Pin_Col__11__BIE CYREG_PRT12_BIE
#define Pin_Col__11__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__11__BYP CYREG_PRT12_BYP
#define Pin_Col__11__DM0 CYREG_PRT12_DM0
#define Pin_Col__11__DM1 CYREG_PRT12_DM1
#define Pin_Col__11__DM2 CYREG_PRT12_DM2
#define Pin_Col__11__DR CYREG_PRT12_DR
#define Pin_Col__11__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__11__MASK 0x08u
#define Pin_Col__11__PC CYREG_PRT12_PC3
#define Pin_Col__11__PORT 12
#define Pin_Col__11__PRT CYREG_PRT12_PRT
#define Pin_Col__11__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__11__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__11__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__11__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__11__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__11__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__11__PS CYREG_PRT12_PS
#define Pin_Col__11__SHIFT 3
#define Pin_Col__11__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__11__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__11__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__11__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__11__SLW CYREG_PRT12_SLW
#define Pin_Col__12__AG CYREG_PRT12_AG
#define Pin_Col__12__BIE CYREG_PRT12_BIE
#define Pin_Col__12__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__12__BYP CYREG_PRT12_BYP
#define Pin_Col__12__DM0 CYREG_PRT12_DM0
#define Pin_Col__12__DM1 CYREG_PRT12_DM1
#define Pin_Col__12__DM2 CYREG_PRT12_DM2
#define Pin_Col__12__DR CYREG_PRT12_DR
#define Pin_Col__12__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__12__MASK 0x10u
#define Pin_Col__12__PC CYREG_PRT12_PC4
#define Pin_Col__12__PORT 12
#define Pin_Col__12__PRT CYREG_PRT12_PRT
#define Pin_Col__12__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__12__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__12__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__12__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__12__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__12__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__12__PS CYREG_PRT12_PS
#define Pin_Col__12__SHIFT 4
#define Pin_Col__12__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__12__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__12__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__12__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__12__SLW CYREG_PRT12_SLW
#define Pin_Col__13__AG CYREG_PRT12_AG
#define Pin_Col__13__BIE CYREG_PRT12_BIE
#define Pin_Col__13__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__13__BYP CYREG_PRT12_BYP
#define Pin_Col__13__DM0 CYREG_PRT12_DM0
#define Pin_Col__13__DM1 CYREG_PRT12_DM1
#define Pin_Col__13__DM2 CYREG_PRT12_DM2
#define Pin_Col__13__DR CYREG_PRT12_DR
#define Pin_Col__13__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__13__MASK 0x20u
#define Pin_Col__13__PC CYREG_PRT12_PC5
#define Pin_Col__13__PORT 12
#define Pin_Col__13__PRT CYREG_PRT12_PRT
#define Pin_Col__13__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__13__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__13__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__13__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__13__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__13__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__13__PS CYREG_PRT12_PS
#define Pin_Col__13__SHIFT 5
#define Pin_Col__13__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__13__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__13__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__13__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__13__SLW CYREG_PRT12_SLW
#define Pin_Col__14__AG CYREG_PRT12_AG
#define Pin_Col__14__BIE CYREG_PRT12_BIE
#define Pin_Col__14__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__14__BYP CYREG_PRT12_BYP
#define Pin_Col__14__DM0 CYREG_PRT12_DM0
#define Pin_Col__14__DM1 CYREG_PRT12_DM1
#define Pin_Col__14__DM2 CYREG_PRT12_DM2
#define Pin_Col__14__DR CYREG_PRT12_DR
#define Pin_Col__14__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__14__MASK 0x40u
#define Pin_Col__14__PC CYREG_PRT12_PC6
#define Pin_Col__14__PORT 12
#define Pin_Col__14__PRT CYREG_PRT12_PRT
#define Pin_Col__14__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__14__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__14__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__14__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__14__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__14__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__14__PS CYREG_PRT12_PS
#define Pin_Col__14__SHIFT 6
#define Pin_Col__14__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__14__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__14__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__14__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__14__SLW CYREG_PRT12_SLW
#define Pin_Col__15__AG CYREG_PRT12_AG
#define Pin_Col__15__BIE CYREG_PRT12_BIE
#define Pin_Col__15__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__15__BYP CYREG_PRT12_BYP
#define Pin_Col__15__DM0 CYREG_PRT12_DM0
#define Pin_Col__15__DM1 CYREG_PRT12_DM1
#define Pin_Col__15__DM2 CYREG_PRT12_DM2
#define Pin_Col__15__DR CYREG_PRT12_DR
#define Pin_Col__15__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__15__MASK 0x80u
#define Pin_Col__15__PC CYREG_PRT12_PC7
#define Pin_Col__15__PORT 12
#define Pin_Col__15__PRT CYREG_PRT12_PRT
#define Pin_Col__15__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__15__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__15__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__15__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__15__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__15__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__15__PS CYREG_PRT12_PS
#define Pin_Col__15__SHIFT 7
#define Pin_Col__15__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__15__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__15__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__15__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__15__SLW CYREG_PRT12_SLW
#define Pin_Col__2__AG CYREG_PRT6_AG
#define Pin_Col__2__AMUX CYREG_PRT6_AMUX
#define Pin_Col__2__BIE CYREG_PRT6_BIE
#define Pin_Col__2__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__2__BYP CYREG_PRT6_BYP
#define Pin_Col__2__CTL CYREG_PRT6_CTL
#define Pin_Col__2__DM0 CYREG_PRT6_DM0
#define Pin_Col__2__DM1 CYREG_PRT6_DM1
#define Pin_Col__2__DM2 CYREG_PRT6_DM2
#define Pin_Col__2__DR CYREG_PRT6_DR
#define Pin_Col__2__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__2__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__2__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__2__MASK 0x10u
#define Pin_Col__2__PC CYREG_PRT6_PC4
#define Pin_Col__2__PORT 6
#define Pin_Col__2__PRT CYREG_PRT6_PRT
#define Pin_Col__2__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__2__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__2__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__2__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__2__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__2__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__2__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__2__PS CYREG_PRT6_PS
#define Pin_Col__2__SHIFT 4
#define Pin_Col__2__SLW CYREG_PRT6_SLW
#define Pin_Col__3__AG CYREG_PRT6_AG
#define Pin_Col__3__AMUX CYREG_PRT6_AMUX
#define Pin_Col__3__BIE CYREG_PRT6_BIE
#define Pin_Col__3__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__3__BYP CYREG_PRT6_BYP
#define Pin_Col__3__CTL CYREG_PRT6_CTL
#define Pin_Col__3__DM0 CYREG_PRT6_DM0
#define Pin_Col__3__DM1 CYREG_PRT6_DM1
#define Pin_Col__3__DM2 CYREG_PRT6_DM2
#define Pin_Col__3__DR CYREG_PRT6_DR
#define Pin_Col__3__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__3__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__3__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__3__MASK 0x40u
#define Pin_Col__3__PC CYREG_PRT6_PC6
#define Pin_Col__3__PORT 6
#define Pin_Col__3__PRT CYREG_PRT6_PRT
#define Pin_Col__3__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__3__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__3__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__3__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__3__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__3__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__3__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__3__PS CYREG_PRT6_PS
#define Pin_Col__3__SHIFT 6
#define Pin_Col__3__SLW CYREG_PRT6_SLW
#define Pin_Col__4__AG CYREG_PRT6_AG
#define Pin_Col__4__AMUX CYREG_PRT6_AMUX
#define Pin_Col__4__BIE CYREG_PRT6_BIE
#define Pin_Col__4__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__4__BYP CYREG_PRT6_BYP
#define Pin_Col__4__CTL CYREG_PRT6_CTL
#define Pin_Col__4__DM0 CYREG_PRT6_DM0
#define Pin_Col__4__DM1 CYREG_PRT6_DM1
#define Pin_Col__4__DM2 CYREG_PRT6_DM2
#define Pin_Col__4__DR CYREG_PRT6_DR
#define Pin_Col__4__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__4__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__4__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__4__MASK 0x02u
#define Pin_Col__4__PC CYREG_PRT6_PC1
#define Pin_Col__4__PORT 6
#define Pin_Col__4__PRT CYREG_PRT6_PRT
#define Pin_Col__4__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__4__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__4__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__4__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__4__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__4__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__4__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__4__PS CYREG_PRT6_PS
#define Pin_Col__4__SHIFT 1
#define Pin_Col__4__SLW CYREG_PRT6_SLW
#define Pin_Col__5__AG CYREG_PRT6_AG
#define Pin_Col__5__AMUX CYREG_PRT6_AMUX
#define Pin_Col__5__BIE CYREG_PRT6_BIE
#define Pin_Col__5__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__5__BYP CYREG_PRT6_BYP
#define Pin_Col__5__CTL CYREG_PRT6_CTL
#define Pin_Col__5__DM0 CYREG_PRT6_DM0
#define Pin_Col__5__DM1 CYREG_PRT6_DM1
#define Pin_Col__5__DM2 CYREG_PRT6_DM2
#define Pin_Col__5__DR CYREG_PRT6_DR
#define Pin_Col__5__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__5__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__5__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__5__MASK 0x08u
#define Pin_Col__5__PC CYREG_PRT6_PC3
#define Pin_Col__5__PORT 6
#define Pin_Col__5__PRT CYREG_PRT6_PRT
#define Pin_Col__5__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__5__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__5__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__5__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__5__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__5__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__5__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__5__PS CYREG_PRT6_PS
#define Pin_Col__5__SHIFT 3
#define Pin_Col__5__SLW CYREG_PRT6_SLW
#define Pin_Col__6__AG CYREG_PRT6_AG
#define Pin_Col__6__AMUX CYREG_PRT6_AMUX
#define Pin_Col__6__BIE CYREG_PRT6_BIE
#define Pin_Col__6__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__6__BYP CYREG_PRT6_BYP
#define Pin_Col__6__CTL CYREG_PRT6_CTL
#define Pin_Col__6__DM0 CYREG_PRT6_DM0
#define Pin_Col__6__DM1 CYREG_PRT6_DM1
#define Pin_Col__6__DM2 CYREG_PRT6_DM2
#define Pin_Col__6__DR CYREG_PRT6_DR
#define Pin_Col__6__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__6__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__6__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__6__MASK 0x20u
#define Pin_Col__6__PC CYREG_PRT6_PC5
#define Pin_Col__6__PORT 6
#define Pin_Col__6__PRT CYREG_PRT6_PRT
#define Pin_Col__6__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__6__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__6__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__6__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__6__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__6__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__6__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__6__PS CYREG_PRT6_PS
#define Pin_Col__6__SHIFT 5
#define Pin_Col__6__SLW CYREG_PRT6_SLW
#define Pin_Col__7__AG CYREG_PRT6_AG
#define Pin_Col__7__AMUX CYREG_PRT6_AMUX
#define Pin_Col__7__BIE CYREG_PRT6_BIE
#define Pin_Col__7__BIT_MASK CYREG_PRT6_BIT_MASK
#define Pin_Col__7__BYP CYREG_PRT6_BYP
#define Pin_Col__7__CTL CYREG_PRT6_CTL
#define Pin_Col__7__DM0 CYREG_PRT6_DM0
#define Pin_Col__7__DM1 CYREG_PRT6_DM1
#define Pin_Col__7__DM2 CYREG_PRT6_DM2
#define Pin_Col__7__DR CYREG_PRT6_DR
#define Pin_Col__7__INP_DIS CYREG_PRT6_INP_DIS
#define Pin_Col__7__LCD_COM_SEG CYREG_PRT6_LCD_COM_SEG
#define Pin_Col__7__LCD_EN CYREG_PRT6_LCD_EN
#define Pin_Col__7__MASK 0x80u
#define Pin_Col__7__PC CYREG_PRT6_PC7
#define Pin_Col__7__PORT 6
#define Pin_Col__7__PRT CYREG_PRT6_PRT
#define Pin_Col__7__PRTDSI__CAPS_SEL CYREG_PRT6_CAPS_SEL
#define Pin_Col__7__PRTDSI__DBL_SYNC_IN CYREG_PRT6_DBL_SYNC_IN
#define Pin_Col__7__PRTDSI__OE_SEL0 CYREG_PRT6_OE_SEL0
#define Pin_Col__7__PRTDSI__OE_SEL1 CYREG_PRT6_OE_SEL1
#define Pin_Col__7__PRTDSI__OUT_SEL0 CYREG_PRT6_OUT_SEL0
#define Pin_Col__7__PRTDSI__OUT_SEL1 CYREG_PRT6_OUT_SEL1
#define Pin_Col__7__PRTDSI__SYNC_OUT CYREG_PRT6_SYNC_OUT
#define Pin_Col__7__PS CYREG_PRT6_PS
#define Pin_Col__7__SHIFT 7
#define Pin_Col__7__SLW CYREG_PRT6_SLW
#define Pin_Col__8__AG CYREG_PRT12_AG
#define Pin_Col__8__BIE CYREG_PRT12_BIE
#define Pin_Col__8__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__8__BYP CYREG_PRT12_BYP
#define Pin_Col__8__DM0 CYREG_PRT12_DM0
#define Pin_Col__8__DM1 CYREG_PRT12_DM1
#define Pin_Col__8__DM2 CYREG_PRT12_DM2
#define Pin_Col__8__DR CYREG_PRT12_DR
#define Pin_Col__8__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__8__MASK 0x01u
#define Pin_Col__8__PC CYREG_PRT12_PC0
#define Pin_Col__8__PORT 12
#define Pin_Col__8__PRT CYREG_PRT12_PRT
#define Pin_Col__8__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__8__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__8__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__8__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__8__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__8__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__8__PS CYREG_PRT12_PS
#define Pin_Col__8__SHIFT 0
#define Pin_Col__8__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__8__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__8__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__8__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__8__SLW CYREG_PRT12_SLW
#define Pin_Col__9__AG CYREG_PRT12_AG
#define Pin_Col__9__BIE CYREG_PRT12_BIE
#define Pin_Col__9__BIT_MASK CYREG_PRT12_BIT_MASK
#define Pin_Col__9__BYP CYREG_PRT12_BYP
#define Pin_Col__9__DM0 CYREG_PRT12_DM0
#define Pin_Col__9__DM1 CYREG_PRT12_DM1
#define Pin_Col__9__DM2 CYREG_PRT12_DM2
#define Pin_Col__9__DR CYREG_PRT12_DR
#define Pin_Col__9__INP_DIS CYREG_PRT12_INP_DIS
#define Pin_Col__9__MASK 0x02u
#define Pin_Col__9__PC CYREG_PRT12_PC1
#define Pin_Col__9__PORT 12
#define Pin_Col__9__PRT CYREG_PRT12_PRT
#define Pin_Col__9__PRTDSI__DBL_SYNC_IN CYREG_PRT12_DBL_SYNC_IN
#define Pin_Col__9__PRTDSI__OE_SEL0 CYREG_PRT12_OE_SEL0
#define Pin_Col__9__PRTDSI__OE_SEL1 CYREG_PRT12_OE_SEL1
#define Pin_Col__9__PRTDSI__OUT_SEL0 CYREG_PRT12_OUT_SEL0
#define Pin_Col__9__PRTDSI__OUT_SEL1 CYREG_PRT12_OUT_SEL1
#define Pin_Col__9__PRTDSI__SYNC_OUT CYREG_PRT12_SYNC_OUT
#define Pin_Col__9__PS CYREG_PRT12_PS
#define Pin_Col__9__SHIFT 1
#define Pin_Col__9__SIO_CFG CYREG_PRT12_SIO_CFG
#define Pin_Col__9__SIO_DIFF CYREG_PRT12_SIO_DIFF
#define Pin_Col__9__SIO_HYST_EN CYREG_PRT12_SIO_HYST_EN
#define Pin_Col__9__SIO_REG_HIFREQ CYREG_PRT12_SIO_REG_HIFREQ
#define Pin_Col__9__SLW CYREG_PRT12_SLW

/* Pin_1 */
#define Pin_1__0__MASK 0x01u
#define Pin_1__0__PC CYREG_PRT3_PC0
#define Pin_1__0__PORT 3
#define Pin_1__0__SHIFT 0
#define Pin_1__AG CYREG_PRT3_AG
#define Pin_1__AMUX CYREG_PRT3_AMUX
#define Pin_1__BIE CYREG_PRT3_BIE
#define Pin_1__BIT_MASK CYREG_PRT3_BIT_MASK
#define Pin_1__BYP CYREG_PRT3_BYP
#define Pin_1__CTL CYREG_PRT3_CTL
#define Pin_1__DM0 CYREG_PRT3_DM0
#define Pin_1__DM1 CYREG_PRT3_DM1
#define Pin_1__DM2 CYREG_PRT3_DM2
#define Pin_1__DR CYREG_PRT3_DR
#define Pin_1__INP_DIS CYREG_PRT3_INP_DIS
#define Pin_1__LCD_COM_SEG CYREG_PRT3_LCD_COM_SEG
#define Pin_1__LCD_EN CYREG_PRT3_LCD_EN
#define Pin_1__MASK 0x01u
#define Pin_1__PORT 3
#define Pin_1__PRT CYREG_PRT3_PRT
#define Pin_1__PRTDSI__CAPS_SEL CYREG_PRT3_CAPS_SEL
#define Pin_1__PRTDSI__DBL_SYNC_IN CYREG_PRT3_DBL_SYNC_IN
#define Pin_1__PRTDSI__OE_SEL0 CYREG_PRT3_OE_SEL0
#define Pin_1__PRTDSI__OE_SEL1 CYREG_PRT3_OE_SEL1
#define Pin_1__PRTDSI__OUT_SEL0 CYREG_PRT3_OUT_SEL0
#define Pin_1__PRTDSI__OUT_SEL1 CYREG_PRT3_OUT_SEL1
#define Pin_1__PRTDSI__SYNC_OUT CYREG_PRT3_SYNC_OUT
#define Pin_1__PS CYREG_PRT3_PS
#define Pin_1__SHIFT 0
#define Pin_1__SLW CYREG_PRT3_SLW

