MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cyfitter.h
/* Pin_2 */
#define Pin_2__0__MASK 0x02u
#define Pin_2__0__PC CYREG_PRT3_PC1
#define Pin_2__0__PORT 3
#define Pin_2__0__SHIFT 1
#define Pin_2__AG CYREG_PRT3_AG
#define Pin_2__AMUX CYREG_PRT3_AMUX
#define Pin_2__BIE CYREG_PRT3_BIE
#define Pin_2__BIT_MASK CYREG_PRT3_BIT_MASK
#define Pin_2__BYP CYREG_PRT3_BYP
#define Pin_2__CTL CYREG_PRT3_CTL
#define Pin_2__DM0 CYREG_PRT3_DM0
#define Pin_2__DM1 CYREG_PRT3_DM1
#define Pin_2__DM2 CYREG_PRT3_DM2
#define Pin_2__DR CYREG_PRT3_DR
#define Pin_2__INP_DIS CYREG_PRT3_INP_DIS
#define Pin_2__LCD_COM_SEG CYREG_PRT3_LCD_COM_SEG
#define Pin_2__LCD_EN CYREG_PRT3_LCD_EN
#define Pin_2__MASK 0x02u
#define Pin_2__PORT 3
#define Pin_2__PRT CYREG_PRT3_PRT
#define Pin_2__PRTDSI__CAPS_SEL CYREG_PRT3_CAPS_SEL
#define Pin_2__PRTDSI__DBL_SYNC_IN CYREG_PRT3_DBL_SYNC_IN
#define Pin_2__PRTDSI__OE_SEL0 CYREG_PRT3_OE_SEL0
#define Pin_2__PRTDSI__OE_SEL1 CYREG_PRT3_OE_SEL1
#define Pin_2__PRTDSI__OUT_SEL0 CYREG_PRT3_OUT_SEL0
#define Pin_2__PRTDSI__OUT_SEL1 CYREG_PRT3_OUT_SEL1
#define Pin_2__PRTDSI__SYNC_OUT CYREG_PRT3_SYNC_OUT
#define Pin_2__PS CYREG_PRT3_PS
#define Pin_2__SHIFT 1
#define Pin_2__SLW CYREG_PRT3_SLW

/* Miscellaneous */
/* -- WARNING: define names containting LEOPARD or PANTHER are deprecated and will be removed in a future release */
#define CYDEV_CHIP_REVISION_5A_ES1 1
#define CYDEV_CHIP_REV_PANTHER_ES1 1
#define CYDEV_CHIP_MEMBER_5A 2
#define CYDEV_CHIP_FAMILY_PSOC5 2
#define CYDEV_CHIP_DIE_PANTHER 2
#define CYDEV_CHIP_DIE_EXPECT CYDEV_CHIP_DIE_PANTHER
#define autoVrefComparator__CLK CYREG_CMP1_CLK
#define autoVrefComparator__CMP_MASK 0x02u
#define autoVrefComparator__CMP_NUMBER 1
#define autoVrefComparator__CR CYREG_CMP1_CR
#define autoVrefComparator__LUT__CR CYREG_LUT1_CR
#define autoVrefComparator__LUT__MSK CYREG_LUT_MSK
#define autoVrefComparator__LUT__MSK_MASK 0x02u
#define autoVrefComparator__LUT__MSK_SHIFT 1
#define autoVrefComparator__LUT__MX CYREG_LUT1_MX
#define autoVrefComparator__LUT__SR CYREG_LUT_SR
#define autoVrefComparator__LUT__SR_MASK 0x02u
#define autoVrefComparator__LUT__SR_SHIFT 1
#define autoVrefComparator__PM_ACT_CFG CYREG_PM_ACT_CFG7
#define autoVrefComparator__PM_ACT_MSK 0x04u
#define autoVrefComparator__PM_STBY_CFG CYREG_PM_STBY_CFG7
#define autoVrefComparator__PM_STBY_MSK 0x04u
#define autoVrefComparator__SW0 CYREG_CMP1_SW0
#define autoVrefComparator__SW2 CYREG_CMP1_SW2
#define autoVrefComparator__SW3 CYREG_CMP1_SW3
#define autoVrefComparator__SW4 CYREG_CMP1_SW4
#define autoVrefComparator__SW6 CYREG_CMP1_SW6
#define autoVrefComparator__TR CYREG_CMP1_TR
#define autoVrefComparator__TRIM__TR0 CYREG_FLSHID_MFG_CFG_CMP1_TR0
#define autoVrefComparator__TRIM__TR0_HS CYREG_FLSHID_CUST_TABLES_CMP1_TR0_HS
#define autoVrefComparator__WRK CYREG_CMP_WRK
#define autoVrefComparator__WRK_MASK 0x02u
#define autoVrefComparator__WRK_SHIFT 1
#define BCLK__BUS_CLK__HZ 70000000U
#define BCLK__BUS_CLK__KHZ 70000U
#define BCLK__BUS_CLK__MHZ 70U
#define CYDEV_BOOTLOADER_CHECKSUM 0
#define CYDEV_BOOTLOADER_CHECKSUM_BASIC 0
#define CYDEV_BOOTLOADER_CHECKSUM_CRC 1
#define CYDEV_BOOTLOADER_WAIT_COMMAND 1
#define CYDEV_BOOTLOADER_WAIT_TIME 10
#define CYDEV_CHIP_DIE_ACTUAL CYDEV_CHIP_DIE_EXPECT
#define CYDEV_CHIP_DIE_LEOPARD 1
#define CYDEV_CHIP_DIE_UNKNOWN 0
#define CYDEV_CHIP_FAMILY_PSOC3 1
#define CYDEV_CHIP_FAMILY_UNKNOWN 0
#define CYDEV_CHIP_FAMILY_USED CYDEV_CHIP_FAMILY_PSOC5
#define CYDEV_CHIP_JTAG_ID 0x0E13C069
#define CYDEV_CHIP_MEMBER_3A 1
#define CYDEV_CHIP_MEMBER_UNKNOWN 0
#define CYDEV_CHIP_MEMBER_USED CYDEV_CHIP_MEMBER_5A
#define CYDEV_CHIP_REV_EXPECT CYDEV_CHIP_REV_PANTHER_ES1
#define CYDEV_CHIP_REV_LEOPARD_ES1 0
#define CYDEV_CHIP_REV_LEOPARD_ES2 1
#define CYDEV_CHIP_REV_LEOPARD_ES3 3
#define CYDEV_CHIP_REV_LEOPARD_PRODUCTION 3
#define CYDEV_CHIP_REV_PANTHER_ES0 0
#define CYDEV_CHIP_REVISION_3A_ES1 0
#define CYDEV_CHIP_REVISION_3A_ES2 1
#define CYDEV_CHIP_REVISION_3A_ES3 3
#define CYDEV_CHIP_REVISION_3A_PRODUCTION 3
#define CYDEV_CHIP_REVISION_5A_ES0 0
#define CYDEV_CHIP_REVISION_USED CYDEV_CHIP_REVISION_5A_ES1
#define CYDEV_CONFIG_FORCE_ROUTE 0
#define CYDEV_CONFIG_UNUSED_IO 0
#define CYDEV_CONFIGURATION_COMPRESSED 0
#define CYDEV_CONFIGURATION_DMA 1
#define CYDEV_CONFIGURATION_ECC 1
#define CYDEV_CONFIGURATION_IMOENABLED 1
#define CYDEV_CONFIGURATION_MODE 2
#define CYDEV_DATA_CACHE_ENABLED 1
#define CYDEV_DEBUG_ENABLE_MASK 0x01
#define CYDEV_DEBUG_ENABLE_REGISTER CYREG_MLOGIC_DBG_DBE
#define CYDEV_DEBUGGING_DPS 2
#define CYDEV_DEBUGGING_ENABLE 1
#define CYDEV_DEBUGGING_REQXRES 1
#define CYDEV_DEBUGGING_XRES 0
#define CYDEV_ECC_ENABLE 0
#define CYDEV_HEAP_SIZE 4096
#define CYDEV_INSTRUCT_CACHE_ENABLED 1
#define CYDEV_STACK_SIZE 16384
#define CYDEV_USB_CLK_OSC_LOCKING_ENABLED_AT_PWR_UP 
#define CYDEV_VDDA 5.0
#define CYDEV_VDDA_MV 5000
#define CYDEV_VDDD 5.0
#define CYDEV_VDDD_MV 5000
#define CYDEV_VDDIO0 5.0
#define CYDEV_VDDIO0_MV 5000
#define CYDEV_VDDIO1 5.0
#define CYDEV_VDDIO1_MV 5000
#define CYDEV_VDDIO2 5.0
#define CYDEV_VDDIO2_MV 5000
#define CYDEV_VDDIO3 5.0
#define CYDEV_VDDIO3_MV 5000
#define CYDEV_VIO0 5
#define CYDEV_VIO0_MV 5000
#define CYDEV_VIO1 5
#define CYDEV_VIO1_MV 5000
#define CYDEV_VIO2 5
#define CYDEV_VIO2_MV 5000
#define CYDEV_VIO3 5
#define CYDEV_VIO3_MV 5000
#define DMA_CHANNELS_USED__MASK0 0x00003304u
#define CYDEV_BOOTLOADER_ENABLE 0

#endif /* INCLUDED_CYFITTER_H */
